[
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1017/c90000-20084211.html",
        "title": "Israel-Palestine conflict at critical point amid rising concerns, tensions",
        "published_date": "2023-10-17",
        "content": "Israel-Palestine conflict at critical point amid rising concerns, tensions\n\n08:07, October 17, 2023 By GT staff reporters ( Global Times\n\nWith a looming Israeli ground invasion in Gaza and the catastrophic humanitarian crisis that the Palestinian people are facing, the Israel-Gaza conflict is escalating at a crucial point. Israel may not stop its military actions despite mounting pressure from the international community, and the battlefield between Israel and Palestine is now extending to diplomacy and public opinion, which will make the situation more complicated, analysts said, calling for the acceleration of mediation efforts to prevent the situation from getting worse.\n\nThe war has continued for 10 days after Hamas' surprise attack against Israel on October 7. Israel's military said Hamas' attack has killed more than 1,300 people, and injured 3,200 others. In Gaza, the Health Ministry said Monday that Israeli airstrikes have killed at least 2,750 people and wounded at least 9,700, according to media reports.\n\nChina is providing emergency humanitarian assistance to the United Nations Relief and Works Agency for Palestine Refugees in the Near East and the Palestinian National Authority respectively, for the urgent needs of food, medical care and housing in Gaza, a spokesperson from China International Development Cooperation Agency said on Monday.\n\nOn Monday, Chinese Foreign Ministry spokesperson Mao Ning confirmed that four Chinese citizens died in the conflict, two are missing and six injured. Mao added that the operation of commercial flights between China and Israel continues and advised Chinese nationals to return to China as soon as possible. The ministry will provide convenience to Chinese people while closely monitoring the security situation and the situation of land and air travel, she said.\n\nThe crisis has reached a turning point as Israel reportedly plans to conduct ground operations in Gaza. Israel's retaliatory actions have also alarmed the international community and more major countries have increased their efforts at mediation, Liu Zhongmin, a professor at the Middle East Studies Institute of Shanghai International Studies University, told the Global Times.\n\nLiu predicted that Israel will take harsh action against Hamas in an effort to demonstrate its response to the group's attack that left Israel with severest damages in decades.\n\nThe conflict is escalating as Israel is currently adopting a more aggressive offensive policy, which is to completely eradicate Hamas and prevent them from remaining in the Gaza Strip, Sun Degang, director of the Center for Middle Eastern Studies at Fudan University, told the Global Times on Monday.\n\nSun noted that Israel will have to bear the burden of international moral responsibility and increase the political cost of its military actions in the Gaza Strip. However, despite the pressure from the international community, Sun estimated that Israel's military operations will not cease.\n\nMoreover, if internal Palestinian divisions between Fatah and Hamas were to open up, the Israeli-Palestinian situation would become even more complicated, said Sun.\n\nThe international community has criticized Israeli for causing humanitarian crisis and refugee issues, Sun said. \"Furthermore, some countries that previously supported or remained neutral towards Israel may also shift their attitudes,\" he said.\n\nThe situation is becoming worse. Despite the fact that a schedule for a ground operation has not been disclosed, Israel has been reportedly massing troops along the Gaza border. As Israel ordered 1.1 million Palestinians living in the region's north to move to the south and UN agencies issued dire warnings about a catastrophic calamity, more heartbreaking images have been covered by the media.\n\nAccording to Liu, growing support for the Palestinians also reveal growing concerns about the dim future of the conflict because it is difficult to predict when Israel will cease.\n\nThe military battles would continue, and the situation would be more tense and contentious and greater efforts would be made to establish moral superiority, with both Israel and Palestine engaging in diplomatic efforts to gain sympathy or support, said Liu.\n\nThe risk for an escalation exists, Tian Wenlin, a research fellow at the China Institutes of Contemporary International Relations, told the Global Times. Although the main conflict took place in the Gaza Strip, there are some militant anti-Israel groups in the West Bank, and if they decide to launch an attack on Israel together, the fighting will spread. The war fire will also grow if new parties, like Syria and Lebanon, are drawn into the fight, said Tian.\n\nA source with knowledge on escalating Israel-Palestine conflicts told the Global Times on Monday that the goal of Israel's military operations is to eliminate Hamas and to make sure that it will not govern Gaza anymore.\n\n\"For now, I don’t think the ceasefire or peace talks is on the table until Hamas will be eliminated,” the source said.\n\nWith the spillover effect of the Hamas-Israel conflicts affecting Israel-Lebanon and Israel-Syria borders, the source said Israel is not wanting to create another front in the West Bank with any other political branches of the Palestinians. However, there is a risk if there is another front, Israel would need to deal with another front that might affect other countries in the Middle East.\n\nSplit widens\n\nThe prolonged conflict between Israel and Palestine has increased divisions both inside and between the US and the EU, analysts said.\n\nIn response to the deteriorating situation in the Gaza Strip, citizens of numerous European nations and in US colleges demonstrated in the streets for the past days. Also, Ursula von der Leyen, the president of the European Commission, has been under criticism for the past days for an omission of international law when showing support to Israel's \"right to defend itself,\" according to media reports.\n\nSun noted that Europe is very concerned that the current protests may lead to increasing tensions or even conflicts between the Muslim population and pro-Israel forces within their own countries, as well as polarization within the European public opinion sphere.\n\n\"While Europe is politically supportive of Israel, it also fears that if Israel's military actions escalate, it could lead to a spill-over effect, meaning the Israeli-Palestinian conflict spreading to Europe,\" Sun said.\n\nLiu noted that the longer Israel maintains its military operations in the Gaza Strip, the more the EU's position toward Israel would increasingly diverge from US', with more sympathy being shown for Palestine. Moreover, the EU has another serious concern -- if two to three million people are displaced in the Gaza Strip, the refugee situation in the EU will become worse.\n\nOn Sunday, the CBS news released an interview with US President Joe Biden, in which the US President said \"Israel has to respond. They have to go after Hamas,\" but warned that an Israeli occupation of Gaza would be \"a big mistake.\"\n\nIn response to the latest remarks of Biden saying that Israel occupation of Gaza would be \"big mistake\", the source said the occupation of Gaza is not the goal.\n\nThe US is more or less contradicting itself in handling the situation. On the one hand, the US does not want the conflict to escalate, which is why the top US diplomat has been busy meeting with regional nations for the past week. On the other hand, the US still needs to show support for Israel, especially on the diplomatic front, while such a stance and some of the US officials' remarks could also incite Israel to seek retaliation, said Liu.\n\nTian said that the outbreak of the conflict serves as a further proof of the complete failure of the US policy in the Middle East as it attempted to achieve the goal of regional reconciliation but having biased favoring toward Israel.\n\nSun noted that currently, neither side is prepared for the outbreak of the sixth Middle East war. However, if the conflict between Hamas and Israel escalates in the Gaza Strip, and more parties are forced to get involved, \"the conflict will spread and become a regional war between nations.\"\n\nTherefore, the international community should expedite mediation efforts to prevent the situation from escalating and spilling over, the expert noted.\n\nThe Palestinian issue cannot be solved by condemning one party at a certain time. China has always emphasized that it is necessary to see the complex historical context of the matter, rather than simply choosing sides to solve the problem, analysts said.\n\nSpecial Envoy of the Chinese Government on the Middle East Issue Zhai Jun will be visiting the Middle East this week. Mao Ning, the spokesperson of the Foreign Ministry, said that the purpose of Zhai Jun's visit is to gather consensus from the international community, urge relevant parties to cease fire and violence, and promote a cooling down of the situation, in order to create necessary conditions for a political resolution.\n\n(Web editor: Tian Yi, Liang Jun)"
    },
    {
        "source": "http://english.people.com.cn",
        "url": "http://english.people.com.cn/102775/416524/index.html",
        "title": "Observations on America--Special Coverage--People's Daily Online",
        "published_date": null,
        "content": "As clashes between Israel and Palestine continue, another tension is rising on the other side of the globe - on US college campuses. An increasing num…[More]"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1017/c90000-20084200.html",
        "title": "GT Voice: Why is the West keen to politicize China-Russia energy cooperation?",
        "published_date": "2023-10-17",
        "content": "GT Voice: Why is the West keen to politicize China-Russia energy cooperation?\n\n08:01, October 17, 2023 By Global Times ( Global Times\n\nA staff member works at the Yongqing compressor station of the Changling-Yongqing section of the China-Russia east-route natural gas pipeline in Yongqing county, North China's Hebei Province, December 3, 2020. Photo: Xinhua\n\nAhead of Russian Foreign Minister Sergei Lavrov's China visit, which started on Monday, Western media reports focused mainly on energy cooperation between China and Russia. Some Western politicians hold an aggressive and critical view, but admittedly, such normal bilateral cooperation is conducive to stabilizing global energy prices, especially during a sensitive period where the recent escalating Israeli-Palestinian conflict has added uncertainties to the global energy market.\n\nEnergy serves as an important piece in the jigsaw for practical cooperation between China and Russia, and also a positive force for maintaining global energy security. If China's energy supply chain were to be disrupted by zero-sum geopolitical games, it would only serve the interests of the US. The global energy market would suffer an unnecessary shock.\n\nAs has been reported recently, China's crude oil imports have surged in recent months, as refiners built up inventory and increased processing to benefit from higher profits from exporting fuel. One thing is certain: China's energy imports will be driven by economic factors, and oil exporters all over the world will have equal opportunities to have a share of China's energy imports.\n\nAlthough politicians in Washington have highlighted China's trade ties with Russia since the Ukraine crisis, they have no right to pressure China to give up normal economic cooperation that is in accordance with the global trade rules.\n\nWashington has been urging European countries to reduce their reliance on Russia's energy, but what has been the result? The US has replaced Russia as the biggest supplier of crude oil to the EU. That is a big turnaround. As reported by CNN, the US' share of Europe's crude imports increased to 18 percent in December 2022. At a time when Europe is suffering from an energy crisis and global energy prices have risen, American energy exporters have become the biggest winners.\n\nSimilar selfishness and hypocrisy can also be seen in US politicians' concern about China-Russia energy cooperation. If normal cooperation between China and Russia is disrupted, who will fill the space for China's energy imports? Of course, Western politicians hope the gap can be filled by companies from the US and its allies.\n\nCurrently, oil prices have climbed due to fears that the Israeli-Palestinian conflict could embroil the wider petroleum-producing region and threaten global output. Amid global economic uncertainty, China, as one of the world's largest crude oil importers and a critical market, needs to ensure stable energy supply, which can also safeguard the stability of the global energy market.\n\nDespite the critical view from some Western politicians, energy cooperation has always been an important aspect of China-Russia cooperation. There is little doubt that bilateral economic and trade cooperation will continue to develop. China-Russia economic cooperation does not target any third party, and it does not tolerate any third party's interference or coercion.\n\nThe US Energy Information Administration (EIA) said in September that record volumes of crude oil were imported into China during the first half of 2023 because of factors such as refinery expansions in the country. China imported an average of 11.4 million barrels of crude oil per day in the first half of 2023, a 12 percent increase from 2022's annual average of 10.2 million barrels per day. The US EIA said China sourced much of the additional crude oil it imported in the first half of 2023 from Russia, Iran, Brazil, and also the US. It seems China's energy imports are diversified. However, the US, which is a beneficiary of China's increased energy imports, is attempting to make China's energy imports a tool to exert pressure on Beijing, and meanwhile lead other Western countries to politicize energy exports to China.\n\nChina has the right to expand energy cooperation with any trading partner according to its own needs and global trade rules. Amid global economic uncertainty, it is necessary for China to ensure its energy security, which is also conducive to the stability of the global energy market.\n\n(Web editor: Tian Yi, Liang Jun)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1017/c90000-20084353.html",
        "title": "Syrian, Russian presidents hold phone talks on Gaza situation",
        "published_date": "2023-10-17",
        "content": "Syrian, Russian presidents hold phone talks on Gaza situation\n\nXinhua) 09:05, October 17, 2023\n\nForensic experts check bodies of the people killed in a surprise attack by the Gaza-ruling Palestinian Islamic Resistance Movement (Hamas), at the National Center for Forensic Medicine in Tel Aviv, Israel, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Tomer Neuberg/JINI via Xinhua)\n\nDAMASCUS, Oct. 16 (Xinhua) -- Syrian President Bashar al-Assad and his Russian counterpart Vladimir Putin held a phone conversation Monday to discuss the pressing situation in the Gaza Strip, according to Syria's state news agency SANA.\n\nThe two leaders highlighted the urgency in the immediate delivery of humanitarian aid to the besieged, densely-populated enclave, and discussed ways to stop Israeli shelling and the displacement of Palestinians in Gaza, it reported.\n\nAt least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides.\n\nForensic experts work at the National Center for Forensic Medicine in Tel Aviv, Israel, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Tomer Neuberg/JINI via Xinhua)\n\nForensic experts work at the National Center for Forensic Medicine in Tel Aviv, Israel, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Tomer Neuberg/JINI via Xinhua)\n\nForensic experts check bodies of the people killed in a surprise attack by the Gaza-ruling Palestinian Islamic Resistance Movement (Hamas), at the National Center for Forensic Medicine in Tel Aviv, Israel, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Tomer Neuberg/JINI via Xinhua)\n\nForensic experts work at the National Center for Forensic Medicine in Tel Aviv, Israel, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Tomer Neuberg/JINI via Xinhua)\n\nForensic experts check bodies of the people killed in a surprise attack by the Gaza-ruling Palestinian Islamic Resistance Movement (Hamas), at the National Center for Forensic Medicine in Tel Aviv, Israel, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Tomer Neuberg/JINI via Xinhua)\n\nPeople search for survivors among the rubble of a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Rafah, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nPeople search for survivors among the rubble of a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Rafah, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nPeople stand among the rubble of a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Rafah, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nPhoto taken on Oct. 16, 2023 shows a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Rafah. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nPeople mourn their relatives killed in Israeli attacks at a hospital in the southern Gaza Strip city of Rafah, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nPeople wait to collect bodies following Israeli attacks at a hospital in the southern Gaza Strip city of Rafah, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nPeople inspect a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nPeople walk past a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nPeople wait to collect bodies following Israeli attacks at a hospital in the southern Gaza Strip city of Rafah, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Khaled Omar/Xinhua)\n\nChildren walk past a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nA man walks past a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nChildren walk past a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nChildren walk past a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nPeople are seen in darkness in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nA man waits for customers in darkness at a store in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nPeople are seen in darkness in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nPeople are seen in darkness on a street in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nA barrage of rockets are fired from Gaza toward Israel over the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nA man waits for customers in darkness at a store in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nA vendor waits for customers in darkness on a street in the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\nA barrage of rockets are fired from Gaza toward Israel over the southern Gaza Strip city of Khan Younis, on Oct. 16, 2023. At least 2,750 Palestinians were killed by the Israeli army in Gaza, while in Israel, the death toll was at least 1,284 as of Sunday, according to official figures from the two sides. (Photo by Rizek Abdeljawad/Xinhua)\n\n(Web editor: Zhang Kaiwei, Liang Jun)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1017/c90000-20084417.html",
        "title": "Putin says Russia ready to coordinate with partners to end violence, stabilize situation in Middle East",
        "published_date": "2023-10-17",
        "content": "Putin says Russia ready to coordinate with partners to end violence, stabilize situation in Middle East\n\nXinhua) 09:35, October 17, 2023\n\nMOSCOW, Oct. 16 (Xinhua) -- Russian President Vladimir Putin said Monday that Russia is ready to coordinate efforts with all constructively minded partners to bring an end to the violence in the Palestinian-Israeli conflict and stabilize the situation.\n\nThe Russian leader made the statement during separate telephone conversations with Syrian President Bashar al-Assad, Iranian President Ebrahim Raisi, Palestinian President Mahmoud Abbas and Egyptian President Abdel-Fattah al-Sisi on Monday, in which the leaders discussed the recent escalation in the conflict between Israel and Palestine.\n\nPutin stressed the unacceptability of any form of violence against civilians, adding that Moscow is ready to provide all necessary humanitarian assistance.\n\nHe noted that Russia's draft resolution, recently proposed to the United Nations Security Council, calls for the implementation of an immediate humanitarian truce, adding that the resolution is not politicized in any way.\n\nPutin reiterated that a long-term fair solution to the conflict should provide for the establishment of an independent Palestinian state coexisting in peace and security with Israel.\n\nThe leaders further expressed extreme concern over the escalation in hostilities between Palestine and Israel, particularly the \"catastrophic increase\" in the number of civilian casualties and the deepening humanitarian crisis in the Gaza Strip.\n\nAll presidents agreed on the need to implement an immediate ceasefire and humanitarian truce to provide assistance to those in need, particularly considering the serious concern that the conflict could escalate into a regional war.\n\n(Web editor: Liang Jun, Du Mingming)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1017/c90000-20084416.html",
        "title": "Hamas says 200-250 Israeli captives held in Gaza, 22 killed in Israeli attacks",
        "published_date": "2023-10-17",
        "content": "Hamas says 200-250 Israeli captives held in Gaza, 22 killed in Israeli attacks\n\nXinhua) 09:34, October 17, 2023\n\nGAZA, Oct. 16 (Xinhua) -- Al-Qassam Brigades, the armed wing of Hamas, said on Monday that there are 200 to 250 Israeli captives held in Gaza.\n\nIn a televised speech, Abu Obaida, spokesperson of Al-Qassam Brigades, said the group has held 200 prisoners and \"the rest are captured by other resistance factions in the Gaza Strip.\"\n\nObaida added that the ongoing Israeli attacks on Gaza have killed at least 22 Israelis, including Guy Olives, a Tel Aviv-based Israeli artist.\n\nHe noted that the foreigners are not prisoners in Gaza, and they will be released once the current conflict ends.\n\nThe spokesperson also stressed that the armed group is willing to have a prisoner swap with Israel.\n\nOn Oct. 7, Hamas launched a heavy onslaught on Israeli towns adjacent to the Gaza Strip, prompting Israel to launch retaliatory strikes on Gaza. The ongoing Israel-Gaza conflict, now in its tenth day, has killed about 4,000 people on both sides.\n\n(Web editor: Liang Jun, Du Mingming)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1017/c90000-20084415.html",
        "title": "11 Palestinian journalists killed in Gaza",
        "published_date": "2023-10-17",
        "content": "11 Palestinian journalists killed in Gaza\n\nXinhua) 09:34, October 17, 2023\n\nGAZA, Oct. 16 (Xinhua) -- At least 11 Palestinian journalists were killed and 20 more others injured in Israeli attacks on the Gaza Strip, the Palestinian Journalists Syndicate said on Monday.\n\nIn a press statement, the syndicate said 50 local, regional, and international media organizations were targeted in Israeli airstrikes on Gaza, which have continued for 10 days.\n\nMoreover, two journalists have gone missing as they were covering the escalation between Gaza-ruling Palestinian Islamic Resistance Movement (Hamas) and Israel, the syndicate added.\n\nIt also noted that the continued power outage and internet problem in Gaza limited the ability of journalists to continue their coverage.\n\n\"Many journalists were subjected to direct threats and incitements from Israel on social media platforms,\" the syndicate said, calling on the international community to intervene to protect journalists.\n\nHamas launched a surprise attack on Israeli towns adjacent to the Gaza Strip a week ago, prompting Israel to launch retaliatory strikes on Gaza.\n\n(Web editor: Liang Jun, Du Mingming)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1013/c90000-20083333.html",
        "title": "Israeli military warns Palestinians to evacuate Gaza City",
        "published_date": "2023-10-13",
        "content": "Israeli military warns Palestinians to evacuate Gaza City\n\nXinhua) 14:17, October 13, 2023\n\nJERUSALEM, Oct. 13 (Xinhua) -- Israeli Defense Forces (IDF) on Friday ordered residents of Gaza City to evacuate to the southern area of the coastal enclave ahead of a possible Israeli ground offensive.\n\n\"The IDF calls for the evacuation of all civilians ... for their own safety and protection,\" read a statement issued Friday morning.\n\n\"You will be able to return to Gaza City only when another announcement permitting it is made,\" the statement said.\n\nAccording to the IDF, Hamas militants are using underground tunnels in the city to hide.\n\nIsrael is believed to be preparing for a ground incursion on the Gaza Strip, according to media reports and analysis.\n\nSince this round of attacks between Hamas and Israel began on Saturday, Israel has launched hundreds of airstrikes against targets in the Gaza Strip. So far more than 1,500 Palestinians and more than 1,300 Israelis have been killed.\n\n(Web editor: Tian Yi, Liang Jun)"
    }
]