[
    {
        "source": "http://english.people.com.cn",
        "url": "http://english.people.com.cn/102775/518047/index.html",
        "title": "Chinese President Xi Jinping attends China-U.S. summit meeting and 30th APEC Economic Leaders' Meeting--Special Coverage--People's Daily Online",
        "published_date": null,
        "content": "Against the picturesque backdrop of the Filoli Estate in the U.S. state of California on Wednesday, a high-stakes meeting captured the world's attention.\n\n\n\n\n\nDisagreements should not be a chasm that keeps the two countries apart. Instead, the two sides should look for ways to build bridges to help them walk toward each other, Xi said at a summit with U.S. President Joe Biden at Filoli Estate, a country house approximately 40 km south of San Francisco, California.\n\n\n\n\n\n\"China will realize reunification, and this is unstoppable,\" Xi said during his summit meeting with U.S. President Joe Biden at Filoli Estate, a country house approximately 40 km south of San Francisco, California."
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1116/c90000-20098047.html",
        "title": "China shares development dividends with APEC economies",
        "published_date": "2023-11-16",
        "content": "China shares development dividends with APEC economies\n\nChina Daily) 09:49, November 16, 2023\n\nSHI YU/CHINA DAILY\n\nUnwavering support also shown for trade liberalization and WTO\n\nAt several wharves owned by New Times Shipbuilding Co in Jingjiang, Jiangsu province, engineers and workers are busy welding steel hulls and testing equipment.\n\nTheir mission is to ensure that their work meets standards set by various ship classification societies and the specific demands of clients.\n\nBut the majority of the container ships and oil and chemical tankers built at the shipyard will not be delivered to domestic buyers.\n\nInstead, they will go to shipowners in many Asia-Pacific Economic Cooperation economies, including Singapore, Indonesia and the United States, as these countries are experiencing a significant surge in demand for new vessels equipped with dual-fuel engines, and offered at competitive prices. Deliveries of these vessels address the rising need for ocean shipping services.\n\nDu Haiming, assistant director of the sales department at New Times Shipbuilding Co, said, \"Even though many parts of the world still face uncertainty and challenges in the global economy, including fragile supply chains and subdued investment sentiment, orders placed by our clients in the Asia-Pacific region have remained high since last year.\"\n\nGovernment officials and experts noted China's precedent-setting role in fostering mutually beneficial cooperation in the Asia-Pacific region and encouraging APEC economies to bolster their economic and technological exchanges.\n\nThey emphasized that China, as a major trading nation, has not only supplied a significant quantity of manufacturing products to other APEC markets, but has also distinguished itself for unwavering support of trade liberalization, the World Trade Organization and its rules.\n\nChina's foreign trade with APEC economies amounted to $3.74 trillion last year, representing 59.7 percent of the country's total import and export value. Among China's top 10 trading partners, eight of them are APEC economies, Ministry of Commerce data show.\n\nWu Haiping, director of the general operations department at the General Administration of Customs, said that after more than three decades of development, cooperation among APEC economies has evolved beyond the two traditional pillars of trade liberalization and investment facilitation, as well as economic and technological cooperation. It has extended into new domains, including technology innovation, modern agriculture, trade in services, inclusive growth, and digital and green economies.\n\nAn economic analysis published by the APEC Policy Support Unit shows that economic growth in the APEC region is expected to reach 3.1 percent this year, following a 2.6 percent moderation last year.\n\nWith APEC playing a key role in supporting the world's economic recovery, He Yadong, spokesman for the Ministry of Commerce, said early this month that China will take proactive steps to advance its accession into the Comprehensive and Progressive Agreement for Trans-Pacific Partnership and the Digital Economy Partnership Agreement.\n\nHe said China looks forward to joining these two trade deals at an early date, and is willing to make joint efforts with all parties to actively promote regional economic integration and the liberalization and facilitation of trade and investment in the Asia-Pacific region.\n\nZhao Ping, dean of the academy at the China Council for the Promotion of International Trade, said multilateral mechanisms for economic cooperation and free trade deals, such as APEC, the Regional Comprehensive Economic Partnership agreement, and the Free Trade Area of the Asia-Pacific, are practical in promoting free trade and consolidating the achievements of globalization. This is especially the case in view of a slowdown in global economic growth, Zhao said.\n\nKok Ping Soon, CEO of the Singapore Business Federation, which represents more than 29,000 Singaporean companies globally, said China has the dual advantages of rapid economic growth and technological progress, coupled with the mature development of its businesses.\n\n\"We welcome Chinese companies to set up regional hubs in Singapore to extend their reach into other APEC economies, especially countries in Southeast Asia,\" Kok said.\n\nNaja Aki, vice-president of Toshiba (China) Co, said numerous valuable experiences can be shared with other countries in the Asia-Pacific region, such as China's support for technological innovation, fast development of tech-intensive green products, and the provision of human resource training for the public and private sectors in the region.\n\nTrade development\n\nMany APEC economies are seeking ways to advance free trade in the global economy during the Asia-Pacific Economic Cooperation Economic Leaders' Meeting in San Francisco, amid the proliferation of trade and economic groups.\n\nAs a result, market watchers and business leaders from China and the US believe that improved bilateral economic and trade relations will be conducive to the economic development of both countries and contribute to the stability and growth of the global economy.\n\nChen Wenling, chief economist at the China Center for International Economic Exchanges, said stable business ties between the world's two largest economies will serve to counteract anti-globalization sentiments and growing protectionism.\n\nEfforts by the US to facilitate the reconfiguration of supply chains in the Asia-Pacific region have already encountered substantial obstacles. Supply chains have become longer, more complex, and costlier structures, potentially yielding outcomes contrary to their intended objectives, Chen said.\n\nCraig Allen, president of the US-China Business Council, said: \"The US and China have benefited considerably from their long-standing economic integration. We remain committed to expanding the US-China commercial relationship by advocating for the US companies doing business in China, and look forward to continuing to support that growth in the long run.\n\n\"US businesses continue to be optimistic about the size and dynamism of China's markets. In an evolving world, we need to work together to safeguard strong, stable and resilient global industrial supply chains for the future.\"\n\nLance Rezac, vice-chairman of the US Soybean Export Council, said it has always firmly believed that the Chinese and US economies are deeply intertwined, and that there is a great deal of potential for cooperation. Steady growth in agricultural trade can be observed between the two countries.\n\nRezac predicted that China's demand for soybeans will drive continued growth in the US' soybean trade. From the 2024 marketing year to the 2033 marketing year, China's soybean imports are expected to rise from 101.5 million metric tons to 134.1 million tons, an average annual growth rate of 3.1 percent.\n\nData from the US Department of Agriculture show that China's soybean imports from the US totaled 31.5 million tons in the 2023 marketing year — which ran from September last year to August — accounting for 59 percent of US annual soybean exports, a rise of 2.3 percent year-on-year.\n\nDeep involvement\n\nEager to secure more market share in China, more than 200 US exhibitors took part in the sixth China International Import Expo in Shanghai this month. They included a wide range of agriculture, automotive, technology, consumer goods, pharmaceutical and healthcare companies. It was the largest US delegation in the expo's history, information released by the American Chamber of Commerce in Shanghai shows.\n\nArnold Li, senior vice-president of Ingersoll Rand, a US industrial goods manufacturer and six-time participant in the Shanghai expo, said well-aligned China-US business relations contribute to the expansion of US companies conducting operations in China.\n\n\"With strong determination and long-term confidence, we will continue to increase investment in local research and development capabilities in China, especially in digitalization and technologies for the new energy sector,\" Li said.\n\nHe said China has progressively bolstered its innovation and production capabilities, which will enable Ingersoll Rand to export more of its products made in China, particularly to economies in the Asia-Pacific region and countries and regions taking part in the Belt and Road Initiative.\n\nTapestry, the luxury goods group headquartered in New York, is upbeat about its Chinese market, and plans to open 60 more stores in the country by the end of 2025.\n\nYann Bozec, Tapestry's president for Asia-Pacific, said: \"China is not just a market, but also a source of inspiration for breakthroughs and fashion innovation. We will continue to explore opportunities for local collaboration to bring more innovative products and experiences to Chinese consumers.\"\n\nLiu Zhenmin, former UN undersecretary-general for economic and social affairs, said in an interview with China Daily last month that China's development presents opportunities, not threats, to the rest of the world. Western countries need to increase their understanding of China and be more accommodating to the nation's development, Liu added.\n\nChinese Commerce Minister Wang Wentao told media last week that the Chinese path to modernization is a way of common prosperity for all the people, and China welcomes companies from all countries to share the dividends of its market.\n\n(Web editor: Liang Jun, Xian Jiangnan)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1116/c90000-20097997.html",
        "title": "APEC set for leading role in globalized economy: China Daily editorial",
        "published_date": "2023-11-16",
        "content": "APEC set for leading role in globalized economy: China Daily editorial\n\nChinadaily.com.cn) 09:09, November 16, 2023\n\nThe Asia-Pacific Economic Cooperation Economic Leaders' Week in San Francisco from Nov 11-17 has caught worldwide attention. Not only are the APEC members some of the fastest growing and most dynamic economies in the world, but also the Asia-Pacific region is at the center of the global economy, driving both growth and innovation.\n\nA regional economic forum established in 1989 to leverage the growing interdependence of the Asia-Pacific economies, APEC, with 21 members today, has become a leading proponent of economic globalization, free trade and multilateral governance.\n\nIt has effectively strengthened macro coordination among economies in the region, accelerating regional economic integration and advancing balanced, inclusive, sustainable, innovative and secure growth.\n\nDuring the week, delegates will take part in high-level meetings and side events with key stakeholders covering a wide range of topics, including: supply chain resilience; science, research, and innovation; critical and emerging technology; clean energy; high-standard infrastructure; women's economic empowerment; and inclusivity.\n\nThe meeting takes place against the backdrop of some developed countries turning to protectionism and unilateralism to help boost their economies, along with the challenges created by the COVID-19 pandemic and escalating geopolitical tensions. In this context, this week's discussions under the overarching theme of\"creating a resilient and sustainable future for all\" are pertinent not only for the region, but for the world as a whole.\n\nOver the past decades, China has closely integrated its own development with regional development, and it is a staunch supporter and active promoter of economic cooperation in the Asia-Pacific region. Through its continual opening-up, the Chinese economy has become closely linked with the other economies in the region and an Asia-Pacific community with a shared future is gradually being formed. In 2022, China's trade with the Asia-Pacific region reached $3.1 trillion, accounting for 36.8 percent of its total foreign trade that year.\n\nAt this week's meeting, participants should oppose all forms of protectionism and reaffirm the region's commitment to uphold a free, open and nondiscriminatory multilateral trading system and a regional cooperation framework that fosters interconnected growth and converging interests in the Asia-Pacific.\n\nIt is a common wish of people in the region that the leaders of the 21 APEC economies, including the three largest in the world, can take full advantage of the multilateral platform to explore ways to work together to boost the region's post-pandemic recovery. The Asia-Pacific should not be viewed as a theater for zero-sum political games, but rather as a stage that is set for mutual achievement and win-win development.\n\n(Web editor: Liang Jun, Xian Jiangnan)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1116/c90000-20098011.html",
        "title": "San Francisco welcomes APEC gathering",
        "published_date": "2023-11-16",
        "content": "San Francisco welcomes APEC gathering\n\nEcns.cn) 09:17, November 16, 2023\n\n(ECNS) -- The 2023 Asia-Pacific Economic Cooperation (APEC) Economic Leaders' Meeting will be held from Wednesday to Friday in San Francisco, the United States.\n\nSan Francisco represents a story of resilience, innovation, and inclusivity, the core themes of APEC this year, according to the official website of APEC 2023.\n\nA road near Union Square is cleaned ahead of the 30th Asia-Pacific Economic Cooperation (APEC) Leaders' Week in San Francisco, California, the United States, Nov. 13, 2023. (Photo: China News Service/Liu Guangan)\n\nNotable attractions in this city include Chinatown, the Golden Gate Bridge, and Fisherman's Wharf.\n\nSan Francisco's cuisine, scenic spots, and unique culture make it one of the most attractive tourist destinations globally, often hailed as the \"most popular city among Americans.\"\n\nThis city is both a financial and trade hub in the Western U.S. and a melting pot of diverse cultures, with Asian Americans representing 33 percent of its total population.\n\nIt is also the first city that Chinese immigrants set foot on American soil. Its Chinese name reflects the initial impressions of Chinese immigrants about the country: a place of wealth and opportunity.\n\nIn the mid-19th century, Chinese immigrants went to the U.S. during the California Gold Rush, and their hard work and intelligence helped them establish themselves, and they gradually became a relatively prosperous community.\n\nSan Francisco’s Chinatown is the first and oldest in North America and one of the largest Chinese communities outside of Asia.\n\nPhoto taken on Nov. 10 shows the bustling Chinatown in San Francisco. (Photo: China News Service/Liu Guanguan)\n\nAs one of the U.S. cities with the largest Chinese populations, San Francisco has maintained close ties with China.\n\nOn Sept. 28, 2018, Chinese Consul General Wang Donghua and San Francisco Mayor London Breed hosted the Chinese national flag-raising ceremony at the City Hall to celebrate the 69th Anniversary of the Founding of the People's Republic of China. Breed declared Oct. 1 as Chinese-American Friendship Day.\n\nOn Feb. 4, 2019, the eve of Chinese Lunar New Year, Breed visited Chinatown, interacting with the local Chinese community, buying festive goods, distributing Spring Festival couplets, and offering New Year greetings in Cantonese.\n\nOn Feb. 25, 2022, the Bay Area Council of San Francisco and Yangpu District of Shanghai held a celebration for Chinese Lunar New Year via video link. The Shanghai Office of the Bay Area Council also organized exchange activities at the Shanghai Knowledge and Innovation Community.\n\nOn Feb. 4, 2023, San Francisco hosted a grand Chinese Lunar New Year Parade. California Attorney General Rob Bonta, Mayor Breed, officials and representatives from other U.S. states and cities, all extended New Year greetings to the audience.\n\nOn Oct. 26, 2023, the Chinese Consulate General in San Francisco and China National Tourism Office in Los Angeles jointly hosted the cultural and tourism promotion event themed \"Hello, China!\" in San Francisco. Representatives from sectors of culture, tourism, and media in the San Francisco Bay Area attended the event.\n\nSan Francisco convened the San Francisco Conference, the grandest international conference of the 20th century, and the signing of the United Nations Charter, which led to the establishment of the United Nations 78 years ago.\n\nToday, this city is welcoming a globally significant event again.\n\n(Web editor: Liang Jun, Xian Jiangnan)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1116/c90000-20097933.html",
        "title": "In pics: buildings destroyed in Israeli airstrike in southern Gaza Strip",
        "published_date": "2023-11-16",
        "content": "In pics: buildings destroyed in Israeli airstrike in southern Gaza Strip\n\nXinhua) 08:43, November 16, 2023\n\nPeople are seen among the rubble of buildings destroyed in an Israeli airstrike in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Khaled Omar/Xinhua)\n\nPeople are seen among the rubble of buildings destroyed in an Israeli airstrike in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Khaled Omar/Xinhua)\n\nA man walks through the rubble of buildings destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Yasser Qudih/Xinhua)\n\nA boy stands among the rubble of buildings destroyed in an Israeli airstrike in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Khaled Omar/Xinhua)\n\nA man sits among the rubble of buildings destroyed in an Israeli airstrike in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Khaled Omar/Xinhua)\n\nPeople inspect the damages caused in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Yasser Qudih/Xinhua)\n\nPeople collect items among the rubble of buildings destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Yasser Qudih/Xinhua)\n\nPeople escape from a building destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Yasser Qudih/Xinhua)\n\nPeople inspect the damages caused in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Yasser Qudih/Xinhua)\n\nPeople collect items among the rubble of buildings destroyed in Israeli airstrikes in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. Israel has been carrying out attacks on Gaza over the past weeks and has imposed a siege on the enclave to retaliate against Hamas attacks on southern Israel. The conflict has so far led to the deaths of over 11,500 Palestinians in Gaza. On the Israeli side, about 1,200 people lost their lives, the majority of whom were killed in the Hamas attack on Oct. 7. (Photo by Yasser Qudih/Xinhua)\n\n(Web editor: Xian Jiangnan, Liang Jun)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1116/c90000-20097924.html",
        "title": "In pics: displaced people at temporary shelter in southern Gaza Strip",
        "published_date": "2023-11-16",
        "content": "In pics: displaced people at temporary shelter in southern Gaza Strip\n\nXinhua) 08:42, November 16, 2023\n\nA displaced child is seen at a temporary shelter converted from a school in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Khaled Omar/Xinhua)\n\nA displaced child is seen at a temporary shelter converted from a school in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Khaled Omar/Xinhua)\n\nDisplaced people are seen at a temporary shelter converted from a school in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Khaled Omar/Xinhua)\n\nDisplaced people are seen at a temporary shelter converted from a school in the southern Gaza Strip city of Rafah, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Khaled Omar/Xinhua)\n\nDisplaced people prepare food at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Yasser Qudih/Xinhua)\n\nDisplaced people are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Yasser Qudih/Xinhua)\n\nDisplaced people are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Yasser Qudih/Xinhua)\n\nDisplaced people are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Rizek Abdeljawad/Xinhua)\n\nDisplaced children are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Rizek Abdeljawad/Xinhua)\n\nDisplaced people are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Rizek Abdeljawad/Xinhua)\n\nDisplaced people are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Rizek Abdeljawad/Xinhua)\n\nA displaced child is seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Rizek Abdeljawad/Xinhua)\n\nDisplaced children are seen at a temporary shelter in the southern Gaza Strip city of Khan Younis, on Nov. 15, 2023. According to the UN Relief and Works Agency for Palestine Refugees in the Near East (UNRWA), almost 1.5 million people have been displaced across the Gaza Strip since October 7, when Hamas carried out a surprise attack on southern Israel. (Photo by Rizek Abdeljawad/Xinhua)\n\n(Web editor: Xian Jiangnan, Liang Jun)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1115/c90000-20097236.html",
        "title": "China's AI robotic chemist synthesizes catalysts for oxygen production on Mars",
        "published_date": "2023-11-15",
        "content": "China's AI robotic chemist synthesizes catalysts for oxygen production on Mars\n\nXinhua) 08:47, November 15, 2023\n\nThis photo taken with a mobile phone shows researchers working with an AI-driven robotic chemist at the University of Science and Technology of China in Hefei, east China's Anhui Province, Nov. 10, 2023. (Xinhua/Zhou Chang)\n\nHEFEI, Nov. 14 (Xinhua) -- An AI-driven robotic chemist, developed by Chinese scientists, has automatically synthesized and intelligently optimized catalysts for the oxygen evolution reaction from Martian meteorites, offering a highly efficient and energy-conserving solution for the production of oxygen on Mars.\n\nUsing a machine-learning model, the AI chemist automatically and swiftly identifies the optimal catalyst formula from more than three million possible compositions. This groundbreaking discovery demonstrates the feasibility of the AI chemist in the automated synthesis of chemicals and materials for Mars exploration, according to the study published in the journal Nature Synthesis on Monday.\n\nLiving on Mars requires the ability to synthesize chemicals that are essential for survival, such as oxygen, from local Martian resources. However, this is a challenging task.\n\nRecent evidence of water activity on Mars has raised the prospect of large-scale oxygen production through solar power-driven electrochemical water oxidation processes using an oxygen evolution reaction catalyst. Considering the high cost of transporting catalysts from the Earth, extraterrestrial catalysts developed from local materials on Mars become a key technical issue.\n\nResearchers from the University of Science and Technology of China (USTC), in collaboration with their counterparts from Chinese research institutes including the Deep Space Exploration Laboratory, analyzed and extracted components from Martian meteorites with a robotic AI chemist and synthesized a new catalyst in just six weeks.\n\nGiven five different local Martian ores as feedstocks, there are over 3.76 million possible formulas, which would cost 2,000 years of human labor to finish such a screening for the optimal formula.\n\nThe study has successfully verified that AI can automatically develop new materials, which is expected to help oxygen production, base construction, and food production on extraterrestrial planets, and synthesize more chemicals from Martian resources to facilitate deep space exploration by humans, according to Luo Yi, director of Hefei National Research Center for Physical Sciences at the Microscale, USTC.\n\nJiang Jun, a professor at USTC, said that the AI chemist built a predictive model by learning over 50,000 related chemistry papers, and delivered a promising catalyst formula coupled with the most suitable synthetic condition within six weeks.\n\nA stress test at minus 37 degrees Celsius, which mimics the temperature condition on Mars, showed that the catalyst can steadily produce oxygen without apparent deterioration, suggesting that it can work in the harsh conditions on Mars, according to the study.\n\n(Web editor: Xian Jiangnan, Liang Jun)"
    },
    {
        "source": "http://en.people.cn",
        "url": "http://en.people.cn/n3/2023/1116/c90000-20098375.html",
        "title": "China has world's largest engineering education system: official",
        "published_date": "2023-11-16",
        "content": "China has world's largest engineering education system: official\n\nXinhua) 16:12, November 16, 2023\n\nNINGBO, Nov. 16 (Xinhua) -- China has built the world's largest engineering education system, Wu Yan, deputy minister of education, told a meeting held in east China's Zhejiang Province on Thursday.\n\nOver the past decade, China's engineering education has witnessed accelerated growth, injecting new momentum into innovation-driven development, Wu told the International Engineering Education Symposium 2023 in the city of Ningbo.\n\nThe number of engineering programs in China's undergraduate education has exceeded 23,000, with more than 6.7 million undergraduate students majoring in engineering, the official said.\n\nHe urged for the continuous optimization of engineering majors and the training of outstanding engineers who can adapt to and lead future developments in engineering technologies, so as to provide strong support for industrial upgrading.\n\n\"Establishing a mechanism for joint training of talents with enterprises is a path we must follow in engineering education,\" Wu said.\n\n(Web editor: Xue Yanyan, Liang Jun)"
    }
]