[
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/world/157876-hamas_zelensky/",
        "title": "Hamas thanks Zelensky for supplying NATO weapons to attack Israel",
        "published_date": "2023-10-10",
        "content": "Hamas thanks Zelensky for supplying NATO weapons to attack Israel\n\nHamas, the Palestinian Islamist movement and ruling political party in the Gaza Strip, thanked Ukrainian President Volodymyr Zelesnky for selling NATO weapons to the movement.\n\nPhoto: t.me/razvedkavpered\n\nA video, in which Hamas militants express their gratitude to Zelensky can be found on the Internet."
    },
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/hotspots/157874-israel_hamas_gaza/",
        "title": "Israeli officials pledge Hamas will no longer exist",
        "published_date": "2023-10-09",
        "content": "Israeli officials pledge Hamas and all of it infrastructure will be obliterated\n\nIsraeli Prime Minister Benjamin Netanyahu called Joe Biden to warn the US President about the start of the ground operation in the Gaza Strip, Walla reports.\n\nPhoto: www.gazeta.ru\n\nDuring the telephone conversation, Netanyahu stressed that showing weakness in the Middle East was unacceptable. Israel will have to respond \"to strength with more strength,” Netanyahu said.\n\nIt was said that Biden did not dissuade the Prime Minister Netanyahu from launching the ground operation in the Gaza Strip.\n\nNetanyahu's actions indicate that Israel is looking for assistance and support among allies during the long military campaign.\n\nNetanyahu earlier said that Israel's military response to the Hamas movement would change the Middle East. What Hamas will have to go through will be hard and terrible, he said.\n\nIsrael announces its goal in the war with Palestine\n\n\"[Martial law] may last a long time (…) until our main goal is achieved, which is the destruction of Hamas's entire infrastructure so that everything that happened will never happen again,” Israeli Ambassador to Moscow, Alexander Ben Zvi said.\n\nThe video below shows Israel's attacks on the Gaza Strip."
    },
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/hotspots/157872-israel_mosque_kadyrov/",
        "title": "Hamas rocket strikes mosque named after Chechnya's late President Kadyrov",
        "published_date": "2023-10-09",
        "content": "Hamas rocket strikes one of the largest mosques in Israel\n\nA rocket fired by Hamas movement struck a mosque in Israel named after first president of Chechnya, Akhmat Kadyrov, the press service of the Israeli Foreign Ministry said on Telegram.\n\nPhoto: https:// vk.com/ramzan\n\nThe mosque is located in the Israeli village of Abu Ghosh near Jerusalem. Black smoke is seen rising above the building of the mosque.\n\nChechen President Ramzan Kadyrov opened the mosque named after his father in Israel in 2014. The mosque is located on the street that was also named after Akhmat Kadyrov. The mosque can house up to 3,000 people; it is one of the largest mosques in the country. According to local publications, the cost of the project amounted to $10 million, two-thirds of which was provided by foundations and public organisations in Chechnya.\n\nEarlier, Hamas reported a rocket attack on Jerusalem. Prior to this, the IDF said that Israel was launching large-scale attacks targeting strategic enemy centres."
    },
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/hotspots/157868-israel_hamas_gaza/",
        "title": "Israel calls up 300,000 in 48 hours to besiege Gaza and behead Hamas",
        "published_date": "2023-10-09",
        "content": "Israel to besiege Gaza and annihilate all of Hamas leaders\n\nIsraeli Defense Minister Yoav Gallant ordered to besiege the Gaza Strip completely.\n\n\"I ordered to besiege the Gaza Strip completely. There will be no electricity, no food, no fuel, everything has been shut down,\" Gallant said after an assessment by the IDF Southern Command in Beersheba, The Times of Israel reports.\n\nAccording to Gallant, Israel is \"fighting animals” and is acting accordingly.\n\nChief spokesman for the Israeli Army, Brigadier General Daniel Hagari, promised that the IDF would annihilate all Hamas military leaders including Yahya Sinwar.\n\n\"Yahya Sinwar is the commander of the campaign, and he is a dead man,” Hagari said in a press conference. Hamas's \"military and political leadership, all of its assets, are attackable, and doomed,” he added, The Times of Israel reports.\n\nThe IDF spokesman also said that troops regained control of all cities in the south of the country on the border with the Gaza Strip. Hamas militants entered those territories on October 7. They partially destroyed border barriers, took control of several Israeli army headquarters and took about 100 people hostage.\n\nAccording to Hagari, there is no fighting in the area, but a small number of militants could still be staying there.\n\nSince the beginning of the hostilities, Hamas fired as many as 4,400 missiles at Israel, the IDF representative noted.\n\nIn 48 hours, the Israeli army mobilised 300,000 reservists, the call was the largest and fastest in the history of Israel, Hagari added.\n\nOne rocket crashed near Ben Gurion Airport in Tel Aviv. The airport building was not damaged, a spokesman later said.\n\nOn October 9 at night, the Israeli military launched rocket attacks on more than 500 targets in the Gaza Strip associated with Hamas and Islamic Jihad — IDF.\n\nMeanwhile, Reuters reported that Hamas had been harbouring plans to attack Israel for two years.\n\nA source close to Hamas told the agency that in preparation for the attacks, a mock-up of an Israeli settlement was built in the Gaza Strip, where the military practiced landing and assault operations.\n\nIsraeli officials were aware of that, but they were convinced that Hamas was not interested in confronting Israel, the source said.\n\nSince the escalation in 2021, Israel issued thousands of work permits to residents of the Gaza Strip to ensure a basic level of economic stability in the region, Reuters said.\n\n\"We believed that as long as they were coming to work and bringing money to Gaza then it would create a certain level of stability. We were wrong,” a source in the Israeli army told the agency.\n\nDeath toll in Gaza rises to 493, more than 2,700 injured — Palestinian Health Ministry.\n\nThe Federation of Jewish Communities of Russia has no information about pilgrims from Russia who could be either killed or injured in Israel. However, there are many victims among repatriates, RIA Novosti reports.\n\nRussian embassies in Israel and Palestine do not yet have information about the injured Russians, Kremlin official spokesman Dmitry Peskov said.\n\n\"We are watching everything that is happening in Israel with great concern. This is a matter of our special concern these days. It is necessary to bring the situation back to a peaceful direction as soon as possible. Spiralling violence is fraught with the escalation of this conflict. This is a great danger for the region,\" Peskov said.\n\nHezbollah assured the Lebanese authorities that it would not attack Israel first, Lebanese Foreign Minister Abdallah Bouhabib said, The Times of Israel reports.\n\nDeath toll in Israel has exceeded 800, about 2,400 injured - Kan Radio."
    },
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/hotspots/157862-hamas_israel/",
        "title": "Hamas attacks Israel: Al-Aqsa Storm vs. Swords of Iron",
        "published_date": "2023-10-07",
        "content": "Hamas attacks Israel: Al-Aqsa Storm vs. Swords of Iron\n\nHamas movement attacked Israel in the morning of October 7. Thousands of missiles were launched on the territory of Israel from the Gaza Strip.\n\nPhoto: https://www.elaosboa.com/\n\nAlarms sounded in many cities across Israel, including Tel Aviv and Jerusalem. Hamas later claimed responsibility for the attacks on Israel. The Israeli army announced the call up of reservists.\n\n\"This is the day of the greatest battle to end the last occupation on earth,\" Mohammad Deif, the leader of the military wing of Hamas.\n\nIn addition to rocket attacks, Hamas is conducting ground operations against Israel.\n\nAccording to Israeli media, Hamas militants seized the Erez checkpoint and then entered the border town of Sderot in southern Israel.\n\nVideos from Sderot show armed people in military uniforms in the streets, sounds of gunfire can be heard.\n\nHamas military arm, the Al-Qassam Brigades claims that its militants captured more than 35 Israeli soldiers and settlers in Sderot. The captivated people were taken to the Gaza Strip.\n\nHamas announced losses of 161 in killed and 930 in wounded militants. Israel lost at least 40 people, 740 were wounded. It was not specified how many of them were civilians and how many accounted for military losses.\n\nIsraeli army declares readiness for war\n\nIsraeli Defence Minister Yoav Galant approved the recruitment of reservists into the army.\n\nIsraeli fighter jets started striking targets in the Gaza Strip. The military block roads around the enclave. The Israeli army announced the start of Iron Swords counter-terrorism operation in the Gaza Strip.\n\nMore videos on Pravda.Ru Telegram channel\n\n\"This morning Hamas made a serious mistake and started a war against the State of Israel. IDF soldiers are fighting the enemy at all infiltration points. The State of Israel will win this war,\" Yoav Galant, Israeli Defence Minister said.\n\nIsrael expects to call up tens of thousands of soldiers. Benjamin Netanyahu said that Israel is in a state of war with Hamas militants. He assured that Hamas would pay for today's attacks.\n\nsaid that Israel is in a state of war with Hamas militants. He assured that Hamas would pay for today's attacks. More than 100 people were injured as a result of Israeli shelling — The Times of Israel. According to the publication, 80 people were hospitalised in the city of Beersheba.\n\nCentral and southern regions of Israel have been under heavy rocket fire for more than 3.5 hours.\n\nHamas launched Al-Aqsa Storm military operation against Israel — the head of the military wing of the movement, Mohammed ad-Deif said.\n\nsaid. Hamas says at least 35 Israeli citizens and military personnel have been delivered to the Gaza Strip, Kan Radio reports.\n\nToday, more than 2,200 rockets were fired at Israel, Hamas attacked Israel from land, sea and air. The fighting is taking place in at least seven locations.\n\nDozens of Israeli fighter jets strike Hamas targets in the Gaza Strip, Israel Defense Forces said.\n\nThere are no Russians among those injured in the rocket attack on Israel, the Russian Embassy in Israel said.\n\n\"This is such an unexpected escalation [of the Israeli-Palestinian conflict], we call for restraint, we are in contact with everyone now — Russian Foreign Ministry spokesman Bogdanov said.\n\nAccording to most recent reports, six people were killed and about 200 injured as a result of the shelling of Israel, The Times of Israel reports.\n\n\"Hamas will pay an unprecedented price for this war, I ordered the clearing of border settlements from terrorists and the mobilisation of reservists,\" Israeli Prime Minister Netanyahu said.\n\nFive people including one journalist were killed in the Gaza Strip, — Palestinian news agency WAFA said.\n\nIsrael is focused on fighting on the border with the Gaza Strip, the IDF is flooding the area with troops and striking the Gaza Strip — Israeli army spokesman said.\n\nAs a result of Israeli strikes on targets in the Gaza Strip, more than 20 people were killed, hundreds were injured. Hamas, Islamic Jihad, DFLP and other groups report losses, NEWSru.co.il says.\n\nAt least 545 people were injured and 22 were killed as a result of rocket attacks in Israel, Israeli Ministry of Health said.\n\nIsrael's Minister of National Security declared a state of emergency throughout the country.\n\nThe IDF has not yet regained control of any of the attacked territories in southern Israel, the fighting continues, Haaretz reports.\n\nIran supports Hamas in its actions against Israel, Adviser to Iranian Supreme Leader Ali Khamenei, General Rahim Safavi said, ISNA reports.\n\nsaid, ISNA reports. In Israel, at least 40 people were killed and 740 others were injured — Channel 12.\n\n198 were killed and more than 1,600 were injured as a result of Israel's attacks on the Gaza Strip, the Palestinian Ministry of Health said.\n\nAt least 40 were killed in Israel and 750 others were injured as a result of rockets attacks, the National Medical Service of Israel said.\n\nHamas captured a large number of Israelis, including senior officers, Hamas deputy head Saleh al-Arouri said.\n\nIsraeli Security Council unanimously approves ground operation in Gaza Strip, Reuters said.\n\nIsraeli Prime Minister Netanyahu informed US President Joe Biden about the need for a long-term military operation in the Gaza Strip, the press service of the Israeli government said.\n\nHamas fighters take hostages, their exact number is still unknown, Yediotnews reports.\n\nHamas has enough Israeli hostages to exchange all Palestinians in Israeli prisons, Hamas deputy head Saleh al-Arouri said.\n\nFierce fighting continues in 25 localities, Hamas fighters attacked more than 50 Israeli military targets — a representative of the al-Qassam Brigades (military wing of Hamas) said.\n\nIsrael strikes Hamas military structures in two multi-story buildings in the Gaza Strip — IDF.\n\nThe high-rise buildings targeted by Israel were residential buildings, Al Jazeera correspondent said.\n\nIsraeli Energy Minister Israel Katz signed a decree to shut down electricity supplies to the Gaza Strip, Yediotnews said."
    },
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/world/157876-hamas_zelensky/",
        "title": "Hamas thanks Zelensky for supplying NATO weapons to attack Israel",
        "published_date": "2023-10-10",
        "content": "Hamas thanks Zelensky for supplying NATO weapons to attack Israel\n\nHamas, the Palestinian Islamist movement and ruling political party in the Gaza Strip, thanked Ukrainian President Volodymyr Zelesnky for selling NATO weapons to the movement.\n\nPhoto: t.me/razvedkavpered\n\nA video, in which Hamas militants express their gratitude to Zelensky can be found on the Internet."
    },
    {
        "source": "https://english.pravda.ru",
        "url": "https://english.pravda.ru/news/world/157876-hamas_zelensky/",
        "title": "Hamas thanks Zelensky for supplying NATO weapons to attack Israel",
        "published_date": "2023-10-10",
        "content": "Hamas thanks Zelensky for supplying NATO weapons to attack Israel\n\nHamas, the Palestinian Islamist movement and ruling political party in the Gaza Strip, thanked Ukrainian President Volodymyr Zelesnky for selling NATO weapons to the movement.\n\nPhoto: t.me/razvedkavpered\n\nA video, in which Hamas militants express their gratitude to Zelensky can be found on the Internet."
    }
]