[
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1687711",
        "title": "Hamas says no plans to engage in talks until fighting ends",
        "published_date": null,
        "content": "CAIRO, October 10. /TASS/. The Palestinian movement Hamas has informed all interested parties that it does not plan to engage in talks about the fate of its Israeli hostages as long as fighting continues, Hamas political bureau chief Ismail Haniyeh said.\n\n\"We have informed all parties that the cases of our Israeli captives will not be opened until fighting ends,\" he noted, as cited by the Al Hadath TV channel.\n\nHaniyeh added that \"it will only be possible to resolve the issue of captive Israelis on Hamas’ terms.\"\n\nAccording to Haniyeh, the operation that radical fighters were conducting in Israel is \"a Palestinian fight, both in terms of the decision [about the operation] and its implementation.\"\n\nMusa Abu Marzouk, a senior Hamas official, earlier announced the capture of at least 100 more hostages, who, according to Palestinian sources, include Israeli troops, namely high-ranking officers, along with civilians. Shortly before that, Islamic Jihad Secretary General Ziyad al-Nakhalah claimed that over 30 Israeli citizens had been captured in an area bordering the Gaza Strip. According to him, there are Israeli service members and Jewish settlers among those captured.\n\nOn October 7, members of the Hamas radical Palestinian movement entered Israel following a shelling attack from Gaza. According to the latest data, clashes and strikes have killed almost 800 Palestinians and left over 4,000 wounded. About 800 Israelis have lost their lives and over 2,000 have been wounded."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/politics/1687691",
        "title": "Moscow clarifying whether Russian nationals present among Hamas hostages in Gaza — Kremlin",
        "published_date": null,
        "content": "MOSCOW, October 10. /TASS/. Russia is taking measures to clarify whether any Russian nationals may be among the hostages being held by the radical Palestinian movement Hamas, Kremlin Spokesman Dmitry Peskov said.\n\n\"We are in touch with the Palestinians,\" the Kremlin official told journalists. \"Indeed, there was some information that individuals with Russian citizenship are purportedly among the hostages,\" he said.\n\nAccording to Peskov, \"the necessary interaction is maintained in order to find out whether it is true or not, and what the future fate of these people is.\"\n\nThe Hamas Palestinian radical group is maintaining interaction with Russia because several hostages taken to the Gaza Strip have Russian citizenship, Hamas official Mousa Abu Marzouk told the Al Jazeera TV channel on Monday. On October 8, he claimed that at least 100 new hostages had been captured. The Palestinians insist that they include not only civilians but also Israeli servicemen, including some senior officers. Earlier, Ziyad al-Nakhalah, Secretary General of the Islamic Jihad, said that over 30 Israelis had been captured during an operation near the Gaza Strip. According to him, the hostages include Israeli soldiers and Jewish settlers.\n\nTensions flared up again in the Middle East on October 7 when Palestinian militants from the Hamas movement attacked Israeli territory from the Gaza Strip. According to the latest official data, almost 700 Palestinians have been killed since the renewed outbreak of violence, while over 3,700 have suffered wounds. In Israel, more than 900 people have lost their lives and about 2,600 have been wounded.\n\nHamas described its operation as a response to the aggressive actions of the Israeli authorities against the Al-Aqsa Mosque in the Old City of Jerusalem. Israel has declared a state of readiness for war and announced a total blockade of the Gaza Strip, home to 2.3 million Palestinians."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1687433",
        "title": "Hamas plans to swap prisoners for Palestinians held in US prisons",
        "published_date": null,
        "content": "TASS, October 10. Hamas plans to use captured Israelis in negotiations for the release of Palestinians detained in the US and Arabs held in Israeli prisons.\n\n\"There are Palestinians held in America [on charges of financing Hamas]. We will ask for their release,\" Hamas spokesman Ali Barakeh told the Associated Press. He added that Hamas would seek the release of all Arabs detained in Israel.\n\nHe also said the militants were ready for \"all scenarios\" of the conflict, including a \"long war.\" According to him, since the 2014 escalation in Gaza, Hamas has been training its own fighters and producing its own rockets.\n\nBarakeh pointed out the reason for Hamas's large-scale attack is the Israeli government's actions toward the Al-Aqsa Mosque in the center of Jerusalem and the increased pressure on Palestinian prisoners held by Israel.\n\nTensions in the Middle East escalated on October 7 with an attack by Hamas militants from the Gaza Strip on Israeli territory. According to the latest official figures, nearly 700 Palestinians were killed and over 3,700 wounded in clashes and shelling, while about 800 Israelis were killed and over 2,000 wounded.\n\nHamas said the attack was in retaliation for Israeli actions against the Al-Aqsa Mosque on Jerusalem's Temple Mount. Israel has declared a state of war and a total blockade of the Gaza Strip."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1687429",
        "title": "Dozens of people with dual citizenship, including Russians, held hostage by Hamas",
        "published_date": null,
        "content": "TASS, October 10. Dozens of Israelis with dual citizenship, including Russians and Chinese, are being held hostage by the radical Palestinian movement Hamas, the movement's spokesman Moussa Abu Marzouk told the Al Jazeera TV channel.\n\nIn response to a question about Hamas' willingness to discuss a ceasefire, he also said that Hamas is open to \"all political dialogues.\"\n\nEarlier, Al Hadath TV quoted the Palestinian movement as saying that Hamas had taken \"dozens of people with dual citizenship\" as hostages; the movement's spokesman did not specify which countries the Israelis captured by Hamas hold dual citizenship in.\n\nTensions in the Middle East escalated on October 7 with an attack by Hamas militants from the Gaza Strip on Israeli territory. According to the latest official figures, nearly 700 Palestinians were killed and over 3,700 wounded in clashes and shelling, while about 800 Israelis were killed and over 2,000 wounded.\n\nHamas said the attack was in retaliation for Israeli actions against the Al-Aqsa Mosque on Jerusalem's Temple Mount. Israel has declared a state of war and a total blockade of the Gaza Strip."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1687411",
        "title": "IN BRIEF: Hamas ready to discuss ceasefire but not hostages, Israel promises war",
        "published_date": null,
        "content": "The radical Palestinian movement Hamas has announced its readiness to discuss a ceasefire with Israel, but has no intention of negotiating the fate of hostages while hostilities continue. It said the hostages included \"dozens of people with dual citizenship.\"\n\nIsraeli Prime Minister Benjamin Netanyahu, in an address to the nation, compared Hamas members with Islamic State (IS or ISIS, an organization banned in Russia) terrorists and vowed to defeat them \"just like the enlightened world defeated ISIS.\"\n\nTASS has gathered the main information about the conflict so far.\n\nWhat conflicting sides say\n\nHamas representatives are \"open to discussing a ceasefire with Israel,\" the movement said in a statement quoted by Al Hadath TV. At the same time, Hamas said it would not \"negotiate prisoners under fire.\"\n\nIn an address to the nation, Israeli Prime Minister Benjamin Netanyahu compared Hamas to the Islamic State, insisting: \"This enemy wanted war and this this is what they will get.\" Earlier, Israeli Foreign Ministry spokesman Lior Hayat said his country would not hold negotiations with Hamas and considered them impossible because of the declared state of war.\n\nCombat operations\n\nThe Israel Defense Forces (IDF) are completing the clearing of areas along the border with the Gaza Strip, Israeli Chief of the General Staff Herzi Halevi said.\n\nCasualties, fate of hostages\n\nSince the beginning of the conflict, according to the latest official data, more than 700 Palestinians have died (mainly in the Gaza Strip, which was subjected to Israeli bombardment), and more than 3,700 have been injured.\n\nThe Israeli side reported about 800 dead and more than 2,700 wounded. Washington said that at least 11 American citizens were among the dead.\n\nThe Russian Embassy in Israel confirmed the death of a Russian citizen on Monday evening. Earlier, diplomats reported four missing, citing lists provided by the Israeli side.\n\nAccording to the Israeli Foreign Ministry, Hamas militants have taken more than 100 people hostage. The movement threatened to execute captured Israelis in case of attacks on homes and civilian objects in the Gaza Strip.\n\nSituation at Israel-Lebanon border\n\nThe Israeli side reported shelling from Lebanon and the elimination of several people with weapons who infiltrated into Israel. The military said that it hit three roadblocks of the Lebanese Shiite Hezbollah formation.\n\nResponsibility for the attack on the Lebanese-Israeli border was claimed by members of Al-Quds Brigades (the Jerusalem Brigades, the armed wing of the Islamic Jihad group, which also operates in the Gaza Strip). The attack on Israeli positions was later claimed by Hezbollah.\n\nThe Israeli Foreign Ministry, commenting on the situation on the border with Lebanon, said that the neighboring country and Hezbollah should not \"test the patience\" of the country.\n\nInternational reaction\n\nThe Russian Foreign Ministry advised Russians to refrain from visiting Israel and Palestine. The ministry pointed out that Russian airlines have been instructed to return and exchange tickets without penalty.\n\nRussian Deputy Foreign Minister Mikhail Bogdanov received Palestinian Ambassador Abdel Hafiz Nofal on Monday. According to the ambassador, preparations are underway for a visit to Moscow by Palestinian leader Mahmoud Abbas.\n\nUN Secretary General Antonio Guterres said that he was concerned by Israel's intention to impose a complete blockade on Gaza and called for international law to be respected in the conduct of military operations. He said that peace in the Middle East is only possible through negotiations and a \"two-state solution.\"\n\nTurkish President Recep Tayyip Erdogan, in an address to the nation, said that he was willing to mediate. He said that he had held telephone conversations with the leaders of several countries, including Abbas and Israeli President Isaac Herzog. Erdogan also criticized Israeli policy toward Palestine and called for the establishment of a Palestinian state within the 1967 borders.\n\nSituation in Israel\n\nNetanyahu called on opposition leaders to form a national unity government \"without preconditions\" as they did \"before the Six-Day War\" in 1967.\n\nIsraeli authorities advised residents to stock up on water, food and medical supplies, saying they would need to spend up to three days in bomb shelters."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/politics/1687405",
        "title": "Russian ambassador to Israel confirms death of Russian citizen in Hamas attack",
        "published_date": null,
        "content": "MOSCOW, October 10. /TASS/. Information about the death of a Russian citizen in a shelling during the Palestinian-Israeli conflict has been confirmed, Russian Ambassador to Israel Anatoly Viktorov said on Channel One.\n\n\"It is with great condolences that I make public for the first time the information that, unfortunately, the death of a Russian citizen has been confirmed. The young man was most likely a permanent resident here, he had both Russian and Israeli citizenship. For us, he is first and foremost a Russian citizen,\" the diplomat said.\n\nHe pointed out that at the moment the Russian side is establishing all the circumstances of the incident and is trying to contact the relatives of the deceased man in order to assist them, if necessary.\n\n\"In addition, we have nine appeals from the relatives of those of our citizens with whom [these] relatives cannot establish contact,\" Viktorov pointed out. \"Unfortunately, I can confirm that four of these nine Russian citizens are on Israeli lists of missing persons. We are working with the Israeli authorities to determine their whereabouts and to establish contact with their relatives,\" the ambassador said.\n\nIsrael came under missile attack from the Gaza Strip on the morning of October 7. Simultaneously, several groups of Palestinian militants from the Hamas movement infiltrated the Jewish state, engaging in fighting with Israeli forces. The Israel Defense Forces (IDF) declared a state of readiness for war and launched retaliatory actions dubbed Operation Iron Swords. Hamas Politburo Head Ismail Haniyeh described the Palestinian operation as a response to aggressive actions by the Israeli authorities against the Al-Aqsa Mosque in the Old City of Jerusalem. Israel has announced a shift to a state of war and a complete blockade of the Gaza Strip. According to the latest figures, the clashes and shelling have left nearly 700 Palestinians dead and about 4,000 wounded, and nearly 800 Israelis dead and more than 2,700 wounded."
    }
]