[
    {
        "source": "https://tass.com",
        "url": "https://tass.com/",
        "title": "TASS Russian News Agency",
        "published_date": null,
        "content": "Israeli-Palestinian conflict\n\nUS official says Israel refined plan for Gaza operation following talks with Washington"
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world",
        "title": "World",
        "published_date": null,
        "content": "Israeli-Palestinian conflict\n\nIsrael agrees with need of humanitarian aid supplies to Gaza Strip — PM Netanyahu"
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/pressreview",
        "title": "Press Review",
        "published_date": null,
        "content": "Press review: Israel plows ahead into Gaza catacomb and more US aid for Kiev not done deal"
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/team",
        "title": "TASS Russian News Agency",
        "published_date": null,
        "content": "\"We are going to do all we possibly can to make sure that all the hostages of all nationalities come out of Gaza,\" he said"
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1702323",
        "title": "UN Security Council to hold session on Middle East settlement on Nov. 9 — UAE envoy",
        "published_date": null,
        "content": "UN, November 7. /TASS/. The United Nations Security Council will gather on November 9 for an open session on the Middle East conflict settlement, Lana Zaki Nusseibeh, the United Arab Emirates Ambassador and Permanent Representative to the United Nations, said.\n\nAccording to her, China, which holds the rotating chair in the UN Security Council this month, intends organizing regularly both formal and informal UNSC sessions regarding the humanitarian catastrophe in the Gaza Strip.\n\nLana Zaki Nusseibeh also stated that all 15 members of the UN Security Council participate in consultations on the Middle East conflict settlement document that was proposed by the organization’s ten non-permanent member states.\n\nLast month, the UN Security Council failed to adopt any of the four draft resolutions on the Palestinian-Israeli conflict. The ten non-permanent members of the UN Security Council drafted their own document, which is expected to incorporate provisions from previous draft resolutions.\n\nTensions flared up again in the Middle East on October 7 when militants from the Gaza Strip-based Palestinian radical group Hamas staged a surprise incursion into Israeli territory from Gaza. Hamas described its attack as a response to the aggressive actions of Israeli authorities against the Al-Aqsa Mosque on the Temple Mount in Jerusalem’s Old City.\n\nIn response, Israel has announced a total blockade of the Gaza Strip, home to 2.3 million Palestinians, and begun delivering air strikes on the enclave and certain parts of Lebanon and Syria. Clashes are underway in the West Bank as well."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/russia/1702321",
        "title": "US-Russia ties’ stabilization unlikely if Washington keeps stance of strength — ambassador",
        "published_date": null,
        "content": "Press review: Israel plows ahead into Gaza catacomb and more US aid for Kiev not done deal\n\nTop stories from the Russian press on Wednesday, November 1st\n\nRead more"
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/pressreview/1700015",
        "title": "Press review: Israel plows ahead into Gaza catacomb and more US aid for Kiev not done deal",
        "published_date": null,
        "content": "Underground tunnels and high-density housing complexes remain the main obstacles hindering Israel’s ground forces from advancing in the Hamas-controlled Gaza Strip. Nevertheless, Israel announced the launch of stage three of its military action against the radical Palestinian group. In particular, this entails the expansion of ground operations by the Israel Defense Forces (IDF) in the enclave. Israeli airstrikes on the Gaza Strip are also continuing, Izvestia writes.\n\nMOSCOW, November 1. /TASS/. Israel launches the third stage of its ground operation against Hamas in the Gaza Strip; further US financial aid for Ukraine is far from a done deal as the Middle East takes center stage; and two European leaders are visiting Central Asian capitals but pursuing diverse agendas. These stories topped Wednesday’s newspaper headlines across Russia.\n\nThe media reported on October 31 that at least two IDF armored and infantry divisions, numbering about 20,000 troops, have entered the Palestinian enclave since the start of ground operations was announced. The heaviest fighting is underway in northern Gaza; clashes are also taking place in the Strip’s numerous underground tunnels.\n\nAn intricate network of underground tunnels built by Hamas is what is preventing the IDF from launching a full-scale offensive in the Gaza Strip. The Palestinian resistance’s military infrastructure is 500 kilometers long. In some places, underground corridors go 70 meters deep, although the average depth does not exceed two meters. According to estimates and data from open sources, the underground city consists of 1,300 corridors.\n\n\"There was a plan to blow up these underground tunnels. Israel tried to do that during its military operation in Gaza back in 2014. In my view, the same method will be employed this time, too, even though its effectiveness is questionable. Some say that there is an entire city hidden under the ground. If this is true, it will be hard, if not impossible, to blow up the entire network,\" said Ivan Bocharov, program coordinator of the Russian International Affairs Council.\n\nIn his opinion, a vicious circle is in play in Gaza because in order to blow up the tunnels, Israel needs to control the situation on the ground. That, in turn, is a difficult military objective to achieve because Hamas militants will take full advantage of the tunnels to stop the IDF from gaining a foothold in the Strip. In addition, the Palestinians use the tunnels not only to hide fighters and commanders, but also to smuggle in supplies from Egypt for their self-made weapons production facilities in Gaza.\n\nMedia: More US financial aid for Ukraine still not done deal as priority shifts to Israel\n\nUS House of Representatives Speaker Mike Johnson (Republican, Louisiana), elected last week, and a group of his fellow congressional Republicans have presented a bill providing for $14.3 bln worth of military aid to Israel by cutting funding for the Internal Revenue Service (IRS), the US tax authority. The draft legislation will be submitted to the full House on November 1 and may be put to a vote on Thursday, Vedomosti writes.\n\nThe Democrats are not keen on supporting Johnson, but the looming 2024 congressional and presidential elections as well as the rapidly escalating situation in the Middle East may compel them to discuss his initiative, said Viktoria Zhuravlyova, head of the Center for North American Studies at the Russian Academy of Sciences’ Institute of World Economy and International Relations (IMEMO RAS). Moreover, the expert stressed that rapid developments in Israel and the Gaza Strip may force the Democrats to put the issue of further aid for Ukraine aside for the time being.\n\nLev Sokolshchik, senior researcher at the Center for Comprehensive European and International Studies at the Higher School of Economics (HSE University), views Johnson’s proposal as part of ongoing political horse-trading between the Democrats and Republicans. He explained that the US is now entering its latest election season in earnest, which is having a radicalizing effect on the agendas of both major political parties. \"It will be hard for the parties to reach a compromise and consequently, [US President Joe] Biden will face increasing difficulties in combining aid packages for Israel and Ukraine. However, further assistance for Ukraine is still an open question and, thus, remains a subject of heated debate and a key bargaining chip both internally within the Republican Party conference in Congress itself as well as between the Democrats and Republicans,\" the analyst concluded.\n\nAmerican studies expert Eduard Lozansky, in turn, told Izvestia that Kiev still could count on US aid, which, however, will be more modest than expected. \"Many [Republican] lawmakers would like to cut off funding [to Kiev]. They believe that it [Ukraine] is a corrupt bottomless pit and, thus, the US is sending huge amounts of money into a black hole, while there are enormous problems [in need of funding] at home. However, I think that they still will allocate a certain amount of funds. In all likelihood, the aid will not hit the $60 bln mark, but is likely to be in the range of $10 bln to $20 bln, for example. I believe that it will come right after the vote on aid for Israel,\" for which there is a bipartisan consensus, Lozansky emphasized.\n\nFrench President Emmanuel Macron will visit Kazakhstan and Uzbekistan on November 1-2. His goal will be to ensure France’s energy security as the Central Asian countries are rich in uranium, Vedomosti writes, citing Western media reports.\n\nMacron is also said to be seeking to reduce the dependence of Kazakhstan and Uzbekistan on Moscow. Paris believes that Russia’s special military operation in Ukraine has upset the balance of power in the region, thus opening a window of opportunity that France can attempt to exploit. Macron’s activities are viewed as part of the Group of Seven (G7) nations’ policy aimed at strengthening partnership with Kazakhstan.\n\nMeanwhile, Hungarian Prime Minister Viktor Orban will also visit the Kazakh capital of Astana on November 2 to discuss bilateral cooperation with President Kassym-Jomart Tokayev. He will also be an observer at the summit of the Organization of Turkic States, which brings together the leaders of Azerbaijan, Kyrgyzstan, Turkey, Uzbekistan and Turkmenistan.\n\nKazakhstan and Uzbekistan are important partners for France and provide over 50% of the EU country’s uranium, said Pavel Timofeev, sector director at the Department for European Political Studies at the Russian Academy of Sciences’ Institute of World Economy and International Relations (IMEMO RAS). Given issues with Niger after the coup in that uranium-rich country, it has become critical for Paris to strengthen other supply routes because nuclear power plays a key role in the country’s energy system.\n\nIn political terms, France is putting pressure on the countries of the region, some of which are wavering in their traditionally strong relations with Russia. Still, the energy aspect of the Astana and Tashkent visits is more important for Macron strategically because the circle of countries capable of supplying uranium to France is narrower than that of those capable of helping Russia circumvent Western sanctions, Timofeev pointed out.\n\nAs for the Hungarians, they plan to continue to cooperate with Russia in the field of nuclear fuel because it is very difficult technically to change suppliers, Kirill Temetsky, an expert with the Center for Comprehensive European and International Studies at the Higher School of Economics (HSE University), noted. At this point, the Kazakhstan-hosted Organization of Turkic States summit is more important for Orban as the event is in line with Budapest’s multi-directional foreign policy, particularly its ties to the Turkic world. The platform also offers opportunities for Hungary to boost economic and other ties with Astana, the expert explained.\n\nRussia’s share of the global market for liquefied natural gas (LNG) may grow to 30% by 2035, First Deputy Energy Minister Pavel Sorokin said at the St. Petersburg International Gas Forum on October 31, Vedomosti notes.\n\nAccording to Russia’s 2035 energy strategy, the country’s LNG production is expected to reach 100 mln metric tons by 2030, growing to 140 mln tons by 2035. The International Group of Liquefied Natural Gas Importers (GIIGNL) says that Russia’s share of global LNG exports stood at 8.2% in 2022. The country was in fourth place, following Qatar, which had a 20.3% share of the market, Australia (20.2%) and the United States (19.4%).\n\nThe long-term development program for Russia’s LNG production, adopted in March 2021, stipulates that about 20 large-and medium-capacity plants will operate in the country to allow Russia to boost production up to 140 mln tons by 2035.\n\nIn order to increase its share of the global LNG market to 30%, Russia needs to boost annual production to at least 180 mln tons, Finam analyst Sergey Kaufman estimates. In his view, it would be more realistic to expect Russia’s share to grow to 20-23%.\n\nHowever, Maria Belova, research director at the Implementa company, argues that the Russian Energy Ministry’s plans to capture 30% of the market \"don’t look like an unachievable goal.\" Today, LNG projects with a total annual capacity of up to 230 mln tons are at different stages of implementation in Russia, she explained.\n\nAccording to Kaufman, Russian companies can direct additional exports to China, India and other countries in the Asia-Pacific region. Belova specified that Russian LNG projects are competitive enough to claim access \"to any markets not limited by sanctions.\"\n\nThe wind power industry has been caught in a financial storm, Western media outlets report. The sector used to be profitable when interest rates were low and government support was high, but as interest rates went up, Western wind power companies quickly found themselves insolvent. Meanwhile, China continues to produce wind turbines and, now, Chinese companies are producing 60% of wind energy worldwide, Nezavisimaya Gazeta notes.\n\nProblems in the wind power sector have been piling up for several years. Key issues include accelerated inflation and a rise in interest rates. Long-term projects are facing increasing labor and equipment costs, as well as supply chain disruptions.\n\nIn the meantime, China is becoming the dominant player in terms of global wind energy production. The overall capacity of China’s onshore and offshore wind installations doubled in 2022 compared to 2017. It currently exceeds 310 gigawatts, which is roughly equivalent to the total capacity of the world’s top seven wind power producing countries.\n\nIn Russia, the installed capacity of wind power plants rose 1.1-fold in 2022 compared to 2021, according to experts from the Russian Association of Wind Power Industry (RAWI). A total of 75 wind power plants were installed in 2022, and another 325 are at different stages of construction.\n\n\"The wind energy sector in Western countries is developing through subsidies. The intent is to replace energy generation based on imported resources with local resources. The goal of such [wind power] construction projects was not to make money and achieve high profitability but to receive subsidies. In Russia, the wind power industry is based on the principle of cost recovery. No one launches projects in areas where they do not necessarily make economic sense. On the contrary, economic actors choose places where the highest possible profitability can be achieved. In particular, those include Russia’s remote regions where the government subsidizes fuel deliveries. The cost of wind and solar energy is significantly lower there than that derived from fuel oil and coal, which have to be brought to those areas,\" Iva Partners department director Artyom Tuzov pointed out.\n\nTASS is not responsible for the material quoted in these press reviews"
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/pressreview/1699391",
        "title": "Press review: Kiev seen instigating Dagestan riot and Erdogan blasts West in fiery speech",
        "published_date": null,
        "content": "MOSCOW, October 31. /TASS/. Russian officials and experts see Ukrainian fingerprints all over the Dagestan airport riot; Turkish President Recep Tayyip Erdogan is seeking to escalate tensions with Israel and the West over Gaza, at least rhetorically; and Russian Defense Minister Sergey Shoigu and the Pentagon’s top China official are both attending a key Beijing security forum. These stories topped Tuesday’s newspaper headlines across Russia. Media: Russian officials, experts see Ukrainian fingerprints all over Dagestan riot A police officer who was hurt in the riot on October 29 at the Makhachkala airport in the southern Dagestan Region of Russia is in grave condition at a local hospital now, Izvestia has learned. Earlier, law enforcement agencies detained 83 protesters, and a criminal probe into the organizers of the riot has been launched. Dagestan head Sergey Melikov said a Telegram channel that is managed from Ukraine played the key role in instigating the riot, which was discussed at an emergency meeting chaired by Russian President Vladimir Putin last evening.\n\nRead also Russian diplomat says Kiev regime played key role in Dagestani airport incident\n\nThe October 29 riot was organized according to the classic \"color revolution\" playbook, with participants being encouraged to take to the streets together with their entire families \"so that law enforcement agents couldn’t arrest them,\" Igor Ashmanov, a member of the Presidential Council for Civil Society and Human Rights, told Izvestia. In an interview with Nezavisimaya Gazeta, Alexey Makarkin, vice president of the Center for Political Technologies, blamed the situation on a combination of external and domestic factors, noting that the disorder could well have been instigated from the outside given the widespread nature of Internet access. He doubts the government will let the issue go, as a certain red line was crossed, he said, referring to the seizure of a critical state-owned infrastructure facility - the Makhachkala airport. As well, the government will need to make an example of the perpetrators as a lesson to others that such behavior is unacceptable, he added. Aleksey Mukhin, director general of the Center for Political Information, told Nezavisimaya Gazeta that Ukrainian intelligence operatives and their Western handlers were behind the incident. \"They used ‘sleeper’ agents already inside the country to destabilize the situation, which is why important infrastructure was occupied,\" he said. According to Mukhin, the detainees will be vigorously prosecuted. \"It’s an explosive situation, and so our security officials and intelligence agencies will be handling it,\" he concluded. Izvestia: Why Turkey’s Erdogan seeks escalation with West over Gaza A massive pro-Palestinian rally held at Istanbul airport last weekend showed widespread support for Palestine within Turkey, with about 1.5 mln people taking part, according to official reports, giving President Recep Tayyip Erdogan an audience eager to hear his fiery speech demonstrating a willingness to raise tensions against Israel and the West, at least rhetorically.\n\nRead also Turkey to declare Israel a war criminal — Erdogan\n\nThe Turkish leader described the latest actions by the Israel Defense Forces (IDF) in the Gaza Strip, where on October 27 the Israeli military launched a wider offensive against radical Palestinian group Hamas, as a massacre. He said that Israel was \"an occupier and a [criminal] gang rather than a state.\" Erdogan laid the ultimate blame for the developments in the Palestinian enclave on the West, accusing it of hypocrisy, as he pointed to the sharp contrast in how European countries reacted to the situation in Ukraine and to similar events in Gaza. Against this backdrop, he cancelled his trip to Israel, although the itinerary had already been pre-arranged. And Tel Aviv moved to recall its diplomats from Turkey and expel the Turkish diplomatic mission to Israel in the wake of the Istanbul rally. However, Erdogan is unlikely to take any specific steps, despite his heated rhetoric on Israel, said Boris Dolgov, lead researcher at the Russian Academy of Sciences’ Institute of Asian Studies. According to him, Erdogan is seeking to strengthen his position as an opinion leader in the Muslim world, which could potentially become a source of security for Palestine in the future. The expert does not expect Erdogan to escalate things radically in his relationship with the West, despite his rather tough, pointed criticism. While Turkey is unlikely to make any radical changes in the current configuration of its foreign relations, Erdogan could still cause some pain for the West amid the ongoing developments in Palestine, Yelena Suponina, an expert in Asian and Islamic studies, told Izvestia. \"I think this may affect such spheres as Turkey’s partnership with its NATO allies, including as regards Sweden’s membership bid,\" she surmised. Vedomosti: Russian defense minister, Pentagon official both attend Beijing security forum Delegations from more than 90 countries are attending the 10th Xiangshan Forum, running in Beijing on October 29-31. On the sidelines of the event, Russian Defense Minister Sergey Shoigu held talks with Zhang Youxia, vice chairman of China's Central Military Commission. The commission is chaired by Chinese President Xi Jinping. Meanwhile, the position of China’s top defense official has remained vacant since October 24, when Beijing dismissed General Li Shangfu as defense minister. In his keynote speech, Zhang pledged efforts to enhance China’s strategic cooperation and coordination with Russia, while his rhetoric on the United States was somewhat ambiguous. In turn, addressing the forum, Shoigu said that the West may provoke a direct military confrontation between nuclear powers by continuing to supporting Ukraine in its conflict with Russia. He also said Russia was set to continue military and defense cooperation with interested partners in the Asia-Pacific region."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/pressreview/1698815",
        "title": "Press review: IDF shrinking before Gaza maze and Kiev flogs 'peace formula' but buyers few",
        "published_date": null,
        "content": "MOSCOW, October 30. /TASS/. Various factors are restraining Israel from launching a large-scale ground operation in the Gaza Strip; Kiev is continuing to flog Ukrainian President Vladimir Zelensky’s \"peace formula;\" but the Global South is skeptical; and presidents Biden and Xi will meet in San Francisco but the chances are slim for any major Chinese-US agreement. These stories topped Monday’s newspaper headlines across Russia. Izvestia: What to expect from expansion of Israel’s operation in Gaza Ground battles between Israeli troops and Hamas militants in the Gaza Strip have been raging for several days but the Israel Defense Forces (IDF) have not yet launched a full-scale intervention in the enclave, Izvestia writes.\n\nRead also Israeli army expands ground operations in Gaza, hits 600 Hamas targets\n\n\"There currently are two approaches to a potential ground operation. Under the first scenario, Israel will take control of the northern part of the enclave, protecting it from Hamas and creating a security buffer. The second scenario calls for taking full control of the Strip to mop up all infrastructure facilities of Hamas and other organizations,\" Sergey Melkonyan, a researcher at the Russian Academy of Sciences’ Institute of Asian Studies, explained. According to him, Israel will not succeed in carrying out a quick operation given that most of Gaza is interlaced with a maze of underground tunnels and that the approaches to the Strip are heavily mined. There are several factors that make it difficult to say whether Israel will dare to launch a full-scale ground operation. First, it may well result in heavy losses for the IDF, which in turn would harm Israeli Prime Minister Benjamin Netanyahu’s political ambitions. \"The public is pressuring the prime minister to step down because Bibi [Netanyahu] has traditionally sold himself as a political figure who takes Israel’s national security very seriously but his carefully cultivated image as a security hawk is now being seriously tested by this gravest of crises. And, thus far, Israel seems unable to deal with this challenge. It’s difficult to say if the pressure will lead to his resignation. Most likely it will not as he has already made concessions by establishing a united anti-crisis government that actually includes his opponents,\" Melkonyan added. \"Israel has already lost 1,400 people. These are the highest losses the country has ever suffered in a conflict with the Arab world. They want to keep their soldiers safe, which is why Israel is not taking chances,\" military expert Viktor Litovkin said. In addition, a larger-scale operation could also result in the death of the hostages who are being held by Hamas. Vedomosti: Kiev keeps selling Zelensky’s 'peace formula' but Global South not quick to buy Diplomats from 66 countries held a meeting in Malta, initiated by Western countries and Kiev, devoted to discussing Ukrainian President Vladimir Zelenksy’s \"peace formula.\" Moscow rejected the original initiative last year and, so, the third such meeting once again proceeded without any input from Russia’s representatives, Vedomosti notes. The consultations involved officials from the European Union and some countries in the Global South, which is the primary target audience for the initiative. The first two meetings took place in Copenhagen, Denmark, on June 24 and Jeddah, Saudi Arabia, on August 5-6. Participants in the Copenhagen consultations included, in particular, members of the BRICS, except for China and Russia, while China, Egypt and the United Arab Emirates, which attended the Jeddah meeting, refrained from taking part in the Malta event. At each meeting, Kiev presented its 10-point \"peace formula,\" which includes the withdrawal of Russian troops beyond Ukraine’s 1991 borders and steps to ensure energy security, among other things. It remains a priority for Kiev to engage various international actors in efforts to promote its vision of a solution to the conflict, Denis Denisov, an expert at the Financial University under the Government of the Russian Federation, pointed out. As for the participation of Russia-friendly countries, such as India and China, in such meetings, they only attend those negotiation sessions in which they have an interest, but there are no real grounds to say that either New Delhi or Beijing is being drawn into the camp of those supporting Zelensky’s \"peace formula,\" the expert emphasized. Asian and African countries are well aware of what is going on in Ukraine, and so they \"in no way accept\" the so-called Zelensky formula, Dmitry Ofitserov-Belsky, senior researcher at the Russian Academy of Sciences’ Institute of World Economy and International Relations, said. For Zelensky himself, such events represent an attempt to obtain the collective imprimatur of Russia-unfriendly countries, which in turn serves as a lifeline helping him hold on to power in Kiev. To achieve this goal, he needs to share his political plans with non-Western countries. However, Russia’s policy outreach has been far more globally oriented than Ukraine’s, including across the Global South, the expert noted. Nezavisimaya Gazeta: Biden, Xi to meet at APEC but no major Chinese-US agreements in sight The leaders of China and the US have agreed to hold a meeting on the sidelines of the Asia Pacific Economic Cooperation (APEC) Leaders' Meeting in San Francisco on November 11-17. This is the outcome of Chinese Foreign Minister Wang Yi’s Washington talks with US President Joe Biden, Secretary of State Antony Blinken and National Security Advisor Jake Sullivan. However, the road to the summit will not be easy because the US has not given up on the strategy of putting pressure on China as a means of preserving its receding hegemony, Nezavisimaya Gazeta writes."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1702123",
        "title": "Palestinian Health Ministry urges world community to help bring medicine, fuel to Gaza",
        "published_date": null,
        "content": "RABAT, November 6. /TASS/. Palestinian Health Minister Mai Al-Kaila called on the international community to take measures to allow the entry of medicine and fuel for hospitals in the Gaza Strip.\n\n\"The international community and humanitarian organizations must intervene immediately to open the Rafah border crossing with Egypt and allow the entry of medicine and fuel for Gaza hospitals,\" the Palestinian news agency WAFA quoted her as saying.\n\nAccording to Al-Kaila, Israel continues to target hospitals in Gaza. The minister described the Israeli authorities' accusations that the hospitals are used by radicals as \"Israeli attempts to find excuses for bombing.\"."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1702117",
        "title": "Hamas calls on Egypt to provide Gaza with roaming services, Internet connection",
        "published_date": null,
        "content": "CAIRO, November 6. /TASS/. The radical Palestinian movement Hamas has asked Egypt to provide roaming services to the Gaza Strip, where telephone communication and the Internet have been cut off, the movement's spokesman Fawzi Barhoum said.\n\n\"The terrorist Zionist occupation has cut [telephone] services and the Internet in the Gaza Strip <...>. We call on Egypt to open roaming services on Egyptian networks,\" the spokesman said in a statement published on the group’s official Telegram channel.\n\nOn November 5, Palestinian provider Paltel reported that telephone and Internet services had again been disrupted throughout the Gaza Strip. A similar announcement was made by Jawwal, the second provider of telecommunications services in Gaza.\n\nThe complete shutdown of Internet, wireline and cellular services in the Palestinian enclave was first reported on October 27. Paltel and Jawwal said that services had become impossible due to damage to communications caused by Israeli airstrikes. Communications were restored on October 31, as international organizations expressed concern about the inability to reach those remaining in Gaza."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1702115",
        "title": "China, UAE request UN Security Council meeting on Middle East for November 6",
        "published_date": null,
        "content": "UNITED NATIONS, November 6. /TASS/. China and the United Arab Emirates (UAE) have requested a closed-door meeting of the UN Security Council on the Palestinian-Israeli conflict for Monday, a diplomatic source told TASS.\n\n\"China and the UAE have requested a meeting for Monday at 15:00 (8:00 p.m. - TASS),\" the source said. The UN Security Council will discuss, in particular, the strikes on the Palestinian refugee camp Jabalia in the north of the Gaza Strip and a convoy of ambulances near the central Al-Shifa Hospital.\n\nLast month, the UN Security Council failed to adopt any of the four draft resolutions on the Palestinian-Israeli conflict. The ten non-permanent members of the UN Security Council are currently drafting their own document, which is expected to incorporate provisions from previous draft resolutions."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/russia/1701951",
        "title": "Another batch of Russia’s humanitarian aid to Gaza residents sent to Egypt",
        "published_date": null,
        "content": "MOSCOW, November 5. /TASS/. Russia has sent the third batch of humanitarian aid to Gaza residents, the Emergencies Ministry said.\n\n\"Two special planes of the Russian Emergencies Ministry will deliver 60 tons of humanitarian cargoes for the citizens of the Gaza Strip. The Emergencies Ministry’s Il-76s have taken off from the international airport of Grozny to the Arab Republic of Egypt,\" the ministry said in a statement.\n\nThis is the third batch of humanitarian aid to Gaza residents sent by Russia after the situation in the region escalated. Earlier, the Emergencies Ministry’s aircraft delivered 55 tons of cargoes.\n\nTensions flared up again in the Middle East when militants from the radical Palestinian movement Hamas staged a surprise attack on Israeli territory from the Gaza Strip. Hamas described its attack as a response to the aggressive actions of Israeli authorities against the Al-Aqsa Mosque in the Old City of Jerusalem. Israel has announced a total blockade of the Gaza Strip and has been delivering attacks on Gaza as well as some districts in Lebanon and Syria. Clashes are also reported in the West Bank."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1701927",
        "title": "Death toll over 50 in Israel’s strike against refugee camp in Gaza — news agency",
        "published_date": null,
        "content": "CAIRO, November 5 /TASS/. At least fifty-one individuals were killed as a result of an Israeli air strike against the Al-Maghazi refugee camp in the central part of the Gaza Strip, the Palestinian news agency Wafa said.\n\nThe Israeli Air Force attacked a residential building in the refugee camp on Saturday evening, Wafa informed. Women and children make up the majority of victims, the news agency noted. Information was also received about dozens of victims, with many of them still under rubble.\n\nStrikes were also delivered against residential quarters in the north and the west of the Palestinian enclave, apart from the Al-Maghazi camp.\n\nTensions flared up in the Middle East after Hamas militants from the Gaza Strip attacked Israeli territory on October 7, when many Israelis living in the settlements near the border were killed and more than 200 people, including children, women and the elderly, were taken hostage. Hamas views its attack as a response to Israeli authorities’ steps against the Al-Aqsa Mosque in Jerusalem. Israel declared a total blockade of the Gaza Strip and launched bombardments of the enclave and some areas in Lebanon and Syria."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1701921",
        "title": "Sixty hostages go missing due to Israel strikes against Gaza Strip — news agency",
        "published_date": null,
        "content": "ANKARA, November 5 /TASS/. The Izz ad-Din al-Qassam Brigades, the military wing of the Palestinian movement Hamas, said that sixty hostages went missing as a result of Israel’s strikes against the Gaza Strip, the Turkey’s Anadolu Ajansi news agency reported.\n\nBodies of at least twenty-three hostages are under rubble and it does not appear possible to reach them, according to the news agency data."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1701905",
        "title": "Biden announces progress in providing for humanitarian pause in Gaza — White House",
        "published_date": null,
        "content": "WASHINGTON, November 5. /TASS/. US President Joe Biden stated progress on the issue of providing for a humanitarian pause in the Gaza Strip, the White House press pool said.\n\nBiden was asked whether there is progress in supporting the humanitarian pause in the Palestine enclave. \"Yes,\" the US President answered with his thumb up.\n\nHumanitarian pauses during hostilities can be helpful not merely for Palestinian civilians but also to Israel, US Secretary of State Antony Blinken said on Saturday.\n\nTensions flared up in the Middle East after Hamas militants from the Gaza Strip attacked Israeli territory on October 7, when many Israelis living in the settlements near the border were killed and more than 200 people, including children, women and the elderly, were taken hostage. Hamas views its attack as a response to Israeli authorities’ steps against the Al-Aqsa Mosque in Jerusalem. Israel declared a total blockade of the Gaza Strip and launched bombardments of the enclave and some areas in Lebanon and Syria. Clashes are also reported in the West Bank. On October 27, Israel Defense Forces Spokesman Daniel Hagari said the IDF was expanding its ground operation in Gaza."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1701661",
        "title": "US official says Israel refined plan for Gaza operation following talks with Washington",
        "published_date": null,
        "content": "WASHINGTON, November 4. /TASS/. Israel has significantly refined its plan for the military operation in the Gaza Strip following talks with Washington, a senior US official said.\n\nThe official said the \"very direct\" talks are happening all the time and the Israelis \"have significantly refined what originally was their plan.\"\n\nThe US and Israel have conversations every time \"when there are incidents,\" the official said at a news conference.\n\n\"We have regular discussions with the Israelis, offering them some advice from our hard experience,\" he said."
    },
    {
        "source": "https://tass.com",
        "url": "https://tass.com/world/1701657",
        "title": "US uses unarmed Pentagon assets to locate hostages in Gaza — US official",
        "published_date": null,
        "content": "WASHINGTON, November 4. /TASS/. The US is using unarmed assets of the Department of Defense to help locate hostages held by Hamas in the Gaza Strip, a senior US official said at a news conference.\n\n\"We are using unarmed DoD assets to try to help locate some of the American hostages,\" the official said. \"We are going to do all we possibly can to make sure that all the hostages of all nationalities come out of Gaza.\"\n\n\"There's an active process going on here, with multiple lines of effort,\" the official continued. \"Hopefully in a future call we can have some good news on that but it is incredibly difficult, complex and time consuming.\"\n\nThe two Americans that were able to get out of Gaza a couple of weeks ago proved it was possible, the official went on to say.\n\nThe situation in the Middle East sharply escalated following an incursion of Hamas militants from the Gaza Strip into Israel on October 7, accompanied by mass killings of residents of Israeli settlements near the border and taking more than 200 hostages, including children, women and elderly people. Hamas regards the attack as a response to Israeli actions against the Al-Aqsa Mosque on Jerusalem's Temple Mount. Israel has declared a complete siege of the Gaza Strip and has started delivering strikes on that area and parts of Lebanon and Syria. Clashes are also taking place in the West Bank."
    }
]