[
    {
        "source": "http://www.chinadaily.com.cn",
        "url": "http://www.chinadaily.com.cn/a/202311/07/WS654994a4a31090682a5ecc95.html",
        "title": "Tragedy in Gaza necessitates urgent humanitarian cease-fire: UN chief",
        "published_date": "2023-11-07",
        "content": "UN Secretary-General Antonio Guterres speaks at a press conference at the UN headquarters in New York, on Nov 6, 2023. [Photo/Xinhua]\n\nUNITED NATIONS - UN Secretary-General Antonio Guterres said Monday that the unfolding catastrophe in Gaza makes a humanitarian cease-fire more urgent with every passing hour.\n\nThe nightmare in Gaza is more than a humanitarian crisis. It is a crisis of humanity. The intensifying conflict is shaking the world, rattling the region and, most tragically, destroying so many innocent lives, he told a press conference.\n\nGround operations by the Israeli military and continued bombardment are hitting civilians, hospitals, refugee camps, mosques, churches and UN facilities, including shelters. No one is safe. At the same time, Hamas and other militants use civilians as human shields and continue to launch rockets indiscriminately toward Israel, he said.\n\nGaza is becoming a graveyard for children. Hundreds of girls and boys are reportedly being killed or injured every day. More journalists have reportedly been killed over a four-week period than in any conflict in at least three decades. More UN aid workers have been killed than in any comparable period in the history of the world organization, he said.\n\n\"The unfolding catastrophe makes the need for a humanitarian cease-fire more urgent with every passing hour. The parties to the conflict - and, indeed, the international community - face an immediate and fundamental responsibility: to stop the inhuman collective suffering and dramatically expand humanitarian aid to Gaza,\" said Guterres.\n\nSome life-saving aid is getting into Gaza from Egypt through the Rafah crossing. But the trickle of assistance does not meet the ocean of need, he said.\n\nThe Rafah crossing alone does not have the capacity to process aid trucks at the scale required. Just over 400 trucks have crossed into Gaza over the past two weeks, compared with 500 a day before the conflict. And crucially, this does not include fuel. Without fuel, newborn babies in incubators and patients on life support will die. Water cannot be pumped or purified. Raw sewage could soon start gushing onto the streets, further spreading disease. Trucks loaded with critical relief will be stranded, he warned.\n\nThe United Nations and partners are launching a humanitarian appeal worth 1.2 billion US dollars to help 2.7 million people - the entire population of Gaza and half a million Palestinians in the West Bank, including East Jerusalem, he said.\n\n\"The way forward is clear: a humanitarian cease-fire - now; all parties respecting all their obligations under international humanitarian law - now; the unconditional release of the hostages in Gaza - now; the protection of civilians, hospitals, UN facilities, shelters and schools - now; more food, more water, more medicine and of course fuel entering Gaza safely, swiftly and at the scale needed - now; unfettered access to deliver supplies to all people in need in Gaza - now; and the end of the use of civilians as human shields - now,\" said the UN chief.\n\nNone of these appeals should be conditional on the others, he said.\n\nGuterres voiced grave concern about rising violence and an expansion of the conflict.\n\nThe occupied West Bank, including East Jerusalem, is at a boiling point. And there is a need to address the risks of the conflict spilling over to the wider region, he said.\n\n\"We are already witnessing a spiral of escalation from Lebanon and Syria, to Iraq and Yemen. That escalation must stop. Cool heads and diplomatic efforts must prevail. Hateful rhetoric and provocative actions must cease,\" he said.\n\n\"I am deeply troubled by the rise in antisemitism and anti-Muslim bigotry. Jewish and Muslim communities in many parts of the world are on high alert, fearing for their personal safety and security. Emotions are at a fever pitch. Tensions are running high,\" he added.\n\nHe called on UN member states to act now to find a way out of this brutal, awful, agonizing dead end of destruction - to help end the pain and suffering; to help heal the broken; and to help pave the way to peace, to a two-state solution with Israelis and Palestinians living in peace and security."
    },
    {
        "source": "http://www.chinadaily.com.cn",
        "url": "http://www.chinadaily.com.cn/a/202311/07/WS654998a3a31090682a5eccf2.html",
        "title": "Biden faces pressure over Gaza conflict",
        "published_date": "2023-11-07",
        "content": "US President Joe Biden boards a vehicle after arriving at Delaware Air National Guard Base in New Castle, Delaware, US, Nov 6, 2023. [Photo/Agencies]\n\nRejecting truce demand sparks concerns over reelection bid amid public outrage\n\nFrom the United Nations to streets in major cities in the United States and in Europe, US President Joe Biden is receiving mounting demands that he call for a cease-fire in Gaza as scenes of destruction fuel public outrage.\n\nBoth Israeli Prime Minister Benjamin Netanyahu and Biden have remained steadfast in rejecting a cease-fire amid the rising number of casualties, with the continued expansion of Israel's ground forces in Gaza and the growing risk of a wider regional conflict in the Middle East.\n\nBiden has resisted calls for a cease-fire, saying that Israel has a right to defend its citizens but urging it to protect innocent Palestinian civilians in Gaza who are victims of the conflict.\n\nHis refusal to call for a cease-fire is sparking concern about the possible political fallout in his own political party and outside of it. Proponents of a cease-fire argue that the Biden administration's stance may cost him core constituencies he will need to win next year.\n\nSome Muslim and Arab American groups are threatening to withhold donations and votes toward Biden's 2024 reelection unless he takes immediate steps to secure a Gaza cease-fire.\n\nPolls released on Sunday showed that Biden trails Trump in five of the six most important battleground states a year before the US election. The US citizens express doubts about Biden's age and dissatisfaction with his handling of the economy, according to the polls, which were conducted by The New York Times and Siena College.\n\nOn Monday last week, the National Muslim Democratic Council, representing \"dedicated Democratic leaders from across the United States and battleground states\" such as Pennsylvania and Michigan, issued an open letter demanding the Biden administration take action to secure a cease-fire.\n\n\"It has become evident that our voices are being ignored, but our votes will not be,\" the letter stated in closing. \"Simply put, as Gaza turns red, so could crucial battleground states.\"\n\nA poll released on Tuesday last week by the Arab American Institute found that Arab American support for Biden in the 2024 election has dropped to 17 percent, down from 59 percent in 2020, which the organization's president called \"the most dramatic shift over the shortest period of time that I've ever seen\".\n\nDemocrats in Congress have criticized the pace of humanitarian aid, a communications blackout and the rising toll among Palestinian civilians.\n\nThousands converged on the capital over the weekend to protest the Biden administration's support of Israel. Speakers denounced: \"You have blood on your hands.\" Some vowed not to support Biden's bid for a second term in the White House next year as well as campaigns by other Democrats seeking office.\n\nOn Oct 19, a group of over two dozen Democratic senators, including Chris Murphy of Connecticut, called on Biden to work with Israel, Egypt and the UN to deliver fuel to Gaza amid the humanitarian crisis.\n\n\"We should support Israel's right to defend itself. Hamas must be held accountable,\" Murphy wrote on X, the platform formerly known as Twitter. \"But if America is going to pay for a big portion of the war's cost, then of course we should care about the war plan. It would not be good to fund a plan that doesn't work.\"\n\nHumanitarian aid\n\nThe group pressed the US to contribute to the UN's appeal for $294 million in aid \"to address the immediate humanitarian needs in the West Bank and Gaza\".\n\nOne Democratic representative voiced concerns that Biden's position on the current fighting in Gaza could ultimately hurt him politically at home.\n\nPramila Jayapal of Washington State, a liberal ally who has backed Biden's reelection bid, said that she is worried that Biden risks being out of step with the broader US electorate and losing support among the younger voters that he needs to mobilize for his reelection.\n\nAt a White House press briefing last week, National Security Council spokesman John Kirby acknowledged that Israeli forces may, at times, \"fail to meet their own expectations about killing civilians\".\n\nKirby said while the administration is asking Israel \"hard questions\" about its aims in going after Hamas, it is not \"lecturing\" Netanyahu when discussing the need for Israel to follow the rules of war.\n\nAgencies contributed to this story."
    },
    {
        "source": "http://www.chinadaily.com.cn",
        "url": "http://www.chinadaily.com.cn/a/202311/07/WS654977a9a31090682a5ecc17.html",
        "title": "Latin America's call for peace a common wish of countries",
        "published_date": "2023-11-07",
        "content": "MA XUEJING/CHINA DAILY\n\nAt a recent news conference, Bolivia's Deputy Foreign Minister Freddy Mamani announced that Bolivia \"has decided to break diplomatic relations with Israel in repudiation and condemnation of the aggressive and disproportionate Israeli military offensive taking place in the Gaza Strip\", making Bolivia the first country to declare the severing of diplomatic ties with Israel since the outbreak of this round of Israel-Palestine conflict.\n\nOn the same day, Chile and Colombia announced the recalling of their ambassadors to Israel, citing \"unacceptable violations of international humanitarian law committed by Israel in Gaza\" and Israel's \"massacre of the Palestinian people\". Recalling an ambassador means lowering diplomatic relations to the level of charge d'affaires, which is seen as a prelude to breaking off relations between two countries. Israel's Foreign Ministry responded the next day by labeling Bolivia as \"capitulating to terrorism and Iran\".\n\nSources say the Bolivian government took the decision at the urging of former president Evo Morales, who, like current President Luiz Arce, belongs to the Movement Towards Socialism in Bolivia. As early as 2008, when Morales was in office, the Bolivian government had announced severing of diplomatic relations with Israel over the Israeli military operation in Gaza.\n\nBolivia, Chile and Colombia all saw left-wing governments come to power in the \"pink tide\" of Latin America from 2018 to 2022, and their recent breaking or downgrading of diplomatic relations with Israel is giving rise to questions if there will be more \"pink zones\" in Latin America.\n\nAfter the outbreak of the Israel-Palestine conflict, even Saudi Arabia suspended the process of establishing diplomatic relations with Israel. The Organization of Islamic Cooperation and the Arab League have repeatedly condemned Israel's actions. On Wednesday, Jordan announced it was recalling its ambassador to Israel. At a recent special ministerial-level meeting of the Organization of Islamic Cooperation, Iran called on Muslim countries to sever ties with Israel. The worsening humanitarian disaster in Gaza might provoke another round of reactions from the Muslim world.\n\nSo far, the Middle East and North African countries have focused on calling on Israel to immediately call for a cease-fire to protect civilians in the Gaza Strip. However, it seems that the Israeli artillery fire will not stop. If this situation continues, diplomatic relations between the Middle East and North African countries and Israel are bound to return to the chilly state they were in before 2020.\n\nBEIJING NEWS"
    },
    {
        "source": "https://www.dawn.com",
        "url": "https://www.dawn.com/",
        "title": "DAWN.COM",
        "published_date": null,
        "content": "Next PM will not be from Lahore: Bilawal PPP chief says his party is still not getting a level playing field even though it is “showing all signs of winning a majority in Centre\".\n\nRelated\n\nLive Netanyahu says no ‘general ceasefire’ in Gaza without release of hostages Israeli PM says his country will take “overall responsibility” of Gaza’s security for an indefinite period after its war with Hamas ends.\n\n‘Premature’ border closure leaves immigrants under open sky Chaman protest will spread to other areas if demands not met, PkMAP chief Achakzai warns.\n\nPakistan third top recipient of Chinese finance: study Top sector to receive development finance in 2000-2021 was energy with a share of 40pc or $28.4bn.\n\nTauseef Ahmed likely to be made chief selector on temporary basis \"Committee investigating the allegations of conflict of interest against Inzamam could not complete its work,\" sources say.\n\nNot focusing on candidates in Pakistan: US State Dept spokesperson says such decisions [to elect candidates] are for the people of Pakistan to determine.\n\nImran seeks contempt proceedings against jail official Imran's counsel says superintendent of Adiala Jail fails to implement court orders."
    }
]