[
    {
        "source": "http://epaper.chinadaily.com.cn",
        "url": "http://epaper.chinadaily.com.cn/china",
        "title": "CHINADAILY EPAPER",
        "published_date": null,
        "content": "Subway construction workers get inoculated with COVID-19 vaccines in Nantong, Jiangsu province, on Tuesday. Medical experts are urging the public to get vaccinated as soon as possible and to abide by personal hygiene measures. XU CONGJUN/FOR CHINA DAILY See story, page 3\n\nUN calls for efforts to aid Africa's growth After a high-level meeting hosted by China, the United Nations Security Council has spoken in one voice, urging the international community to give Africa equitable access to COVID-19 vaccines and medical supplies.\n\nPAGE TWO\n\nReading marks new chapter in internet age Beijing teacher Bai Yun shares her thoughts about reading books in a 30-minute online video every month, impressing audiences with her erudition and appearance.\n\nTOP NEWS\n\nEvents set to mark Party's centenary Shanghai, the birthplace of the Communist Party of China, will host a series of events in the coming months to celebrate the 100 anniversary of the Party's founding, the CPC Shanghai Municipal Committee announced on Thursday.\n\nCHINA\n\nGuizhou now magnet for foreign investment Mountainous Guizhou province has become a magnet for investment after recently eradicating some of the country's most entrenched poverty and embarking on a greener development path, its Party chief said on Thursday.\n\nPATH TO GLORY\n\nAnhui's essentials: Innovation, industry Editor's note: This year, the Communist Party of China is celebrating the 100th anniversary of its founding. China Daily is publishing a series of stories looking at the tremendous changes that have occurred in provinces, autonomous regions and municipalities under the leadership of the Party. They also include stories of the people and places that have left indelible marks in the Party's path to glory.\n\nCOMMENT\n\nUS should match its words with deeds and truly come back to multilateralism The Joe Biden administration has shown its reluctance to get sidetracked by regional concerns such as the war in Afghanistan and conflicts in the Middle East.\n\nVIEWS\n\nFriends in need and in deed for 70 years Seventy years ago, on May 21, 1951, when Pakistan and China established diplomatic relations, very few people could have imagined that the customary move would lay the foundation for an extraordinary bilateral relationship.\n\nWORLD\n\nUS progressives try to bar arms sale to Israel The administration of US President Joe Biden is on course to approve a $735 million arms sale to Israel in the middle of a raging conflict in the Middle East, as a group of Democratic lawmakers launched an apparently futile attempt on Wednesday to block the sale.\n\nDISCOVER SHANXI\n\nProgressive policies transform Taiyuan's industrial expertise Taiyuan, the capital of Shanxi province, used to be one of the business hubs in North China because of its long history of commercial prosperity.\n\nBUSINESS\n\nCustoms to cut clearance lag for goods The General Administration of Customs is working on a slew of measures, including shortening the overall port clearance time for imports and exports, to further improve port efficiency under the Regional Comprehensive Economic Partnership framework, said a senior Customs official.\n\nVISION CHINA\n\nA glimpse of fantastic future about to unfold China will enter a new era with the further development of artificial intelligence technologies and blossoming industrial applications, said an industry insider on Thursday.\n\nPAKISTAN SPECIAL\n\nEnhanced friendship benefits both nations The future economic and trade ties between China and Pakistan will be decided by stable political relations, the tangible growth of the Belt and Road Initiative and complementary goods trade structure especially in manufacturing and healthcare sectors, said government officials and business leaders.\n\nLIFE\n\nBlossoming of a dream Qiu Yamin, 42, was inspecting her flowers in Chengdu, Southwest China's Sichuan province, one afternoon, while having it livestreamed.\n\nSPORTS\n\nIdols exercise their influence to fashion a fitter future It's time to drop that smartphone, haul yourself off the sofa and get active! That's the message from some of China's prominent sports and entertainment stars as they do their bit to boost the nation's fitness.\n\nADVERTORIAL"
    },
    {
        "source": "http://epaper.chinadaily.com.cn",
        "url": "http://epaper.chinadaily.com.cn/global",
        "title": "CHINADAILY EPAPER",
        "published_date": null,
        "content": "Unaccompanied minors who crossed into the Spanish enclave of Ceuta in North Africa are gathered on Wednesday outside a warehouse used as a temporary shelter as they wait to be tested for COVID-19. The port city of Ceuta lies next to Morocco but falls under Spanish sovereignty. Thousands of migrants, who have become pawns in a diplomatic spat between Morocco and Spain, awoke to an uncertain future on Wednesday, after sleeping wherever they could find shelter following their massive border breach into the Spanish enclave. BERNAT ARMANGUE/AP\n\nXi to address key health summit President Xi Jinping will take part in the Global Health Summit on Friday via video link from Beijing, joining leaders of the Group of 20 members and heads of international and regional organizations in efforts to boost global cooperation in the fight against the COVID-19 pandemic.\n\nPAGE TWO\n\nReading marks new chapter in internet age Beijing teacher Bai Yun shares her thoughts about reading books in a 30-minute online video every month, impressing audiences with her erudition and appearance.\n\nTOP NEWS\n\nWHO report draws lessons from pandemic A report recently published by an independent panel of experts who reviewed the global response to the COVID-19 pandemic has pinpointed equitable and widespread distribution of vaccines, along with the consistent rollout of regular disease control measures, as the linchpin to ending the pandemic.\n\nPATH TO GLORY\n\nAnhui's essentials: Innovation, industry Editor's note: This year, the Communist Party of China is celebrating the 100th anniversary of its founding. China Daily is publishing a series of stories looking at the tremendous changes that have occurred in provinces, autonomous regions and municipalities under the leadership of the Party. They also include stories of the people and places that have left indelible marks in the Party's path to glory.\n\nWORLD\n\nUS progressives try to bar arms sale to Israel The administration of US President Joe Biden is on course to approve a $735 million arms sale to Israel in the middle of a raging conflict in the Middle East, as a group of Democratic lawmakers launched an apparently futile attempt on Wednesday to block the sale.\n\nADVERTORIAL\n\nShanghai to develop five new suburbs over coming years Five new suburbs will be constructed in Shanghai during the 14th Five-Year Plan (2021-25), aimed at becoming \"independent nodes\" to create a fresh round of economic development.\n\nBUSINESS\n\nCustoms to cut clearance lag for goods The General Administration of Customs is working on a slew of measures, including shortening the overall port clearance time for imports and exports, to further improve port efficiency under the Regional Comprehensive Economic Partnership framework, said a senior Customs official.\n\nVISION CHINA\n\nA glimpse of fantastic future about to unfold China will enter a new era with the further development of artificial intelligence technologies and blossoming industrial applications, said an industry insider on Thursday.\n\nCOMMENT\n\nUS should match its words with deeds and truly come back to multilateralism The Joe Biden administration has shown its reluctance to get sidetracked by regional concerns such as the war in Afghanistan and conflicts in the Middle East.\n\nGLOBAL VIEWS\n\nLook back in wonder The Communist Party of China will celebrate its 100th anniversary in July. From an organization with barely a few dozen members in 1921, when it held its first congress, it has now grown to over 90 million members. That is larger than the population of most countries. Its membership has changed as China itself has changed over the last seven decades since it came to power. From an early era in which its key leaders were from a largely rural background, and with military leaders taking the key positions, today it has hundreds of Party schools teaching executive education in order to continue to professionalize its officials. The cultural and educational background of the average Party member today is very different from that of those in the 1950s and 1960s.\n\nLIFE"
    },
    {
        "source": "http://www.chinadaily.com.cn",
        "url": "http://www.chinadaily.com.cn/a/202310/17/WS652dc794a31090682a5e8dd4.html",
        "title": "Access sought for aid to Gaza",
        "published_date": "2023-10-17",
        "content": "Palestinians search for survivors trapped under the rubble of a building destroyed in an Israeli airstrike in Khan Yunis, Gaza Strip, on Monday. MAHMUD HAMS/AGENCE FRANCE-PRESSE\n\nHealth supplies await entry as humanitarian crisis looms\n\nInternational and humanitarian organizations are pleading for \"immediate unconditional access\" for critical aid in Gaza to deter a rapidly escalating crisis with the number of displaced people now estimated to have breached 1 million — 10 days into the violent Palestine-Israel conflict.\n\nThe appeal from the United Nations came as clean water, food and other vital supplies are reportedly running out, with UN Secretary-General Antonio Guterres saying they should not be \"bargaining chips\".\n\nThe World Health Organization said lifesaving assistance, including health supplies to serve 300,000 patients, was awaiting entry through the Rafah crossing into Gaza, The Associated Press reported.\n\nGuterres also urged the Palestinian Islamic Resistance Movement, or Hamas, to release its captives amid looming Israeli ground incursion that seeks to eliminate the militant group.\n\nThe move also forced half of Gaza's 2.3 million population to evacuate their homes. The number appears to be rising — The Associated Press reported that Israeli military has ordered people living in 28 communities near the Lebanese border to evacuate on Monday.\n\nTalks of opening the Rafah border, which Egypt shares with Gaza, have been rife in Western and Middle East media circles. On Monday, Al Jazeera reported that both Israel and Hamas deny any cease-fire in southern Gaza after security sources in Egypt said a deal was due.\n\nEgypt State Information Service, the country's \"main informational, awareness and public relations agency\", published an article on Sunday saying the Rafah border crossing was open, \"but became inoperable after Israel bombed it\", citing its Foreign Minister Sameh Shoukry's interview with CNN.\n\nFurther, Egypt said the Rafah crossing should only be used to send humanitarian aid to Palestinians, citing officials.\n\nDeath toll from both sides has breached 4,000, with over 14,000 injured and more than 1,000 missing.\n\nAppeals for de-escalation\n\nAmid the mass evacuations taking place at short notice in Gaza, appeals to de-escalate the situation continue to increase.\n\nPhilippe Lazzarini, commissioner-general of the United Nations Relief and Works Agency for Palestine Refugees in the Near East, said his agency was \"on the verge of collapse\" and was no longer able to provide humanitarian assistance. The agency is seeking $104 million in funds for lifesaving aid to Gaza.\n\nChina is providing emergency humanitarian aid to the UNRWA and the Palestinian Authority, the China Central Television said on Monday. The aid is to alleviate the humanitarian situation in Gaza and to address the urgent needs, such as food and medical care, CCTV quoted the China International Development Cooperation Agency as saying.\n\nOn Sunday, the United Arab Emirates announced its support to the UNRWA humanitarian response in the Gaza Strip with a new contribution of $20 million.\n\nIsrael's planned ground operation in Gaza, with mass troops and tanks at the border, to \"exterminate Hamas\" has raised doubts in the international community.\n\nThe Arab League and the African Union said in a joint statement on Sunday that it could \"lead to a genocide of unprecedented proportions\", the Arab News and various media reported.\n\nIran has warned Israel of a regional escalation if the Israeli military enters Gaza for a ground operation as the war with Hamas drags on, Al Jazeera reported.\n\nUS President Joe Biden, who was quick to publicly declare support for Israel after Hamas' attack on Oct 7, warned in an interview with CBS News on Sunday that any move by Israel to occupy the Gaza Strip again \"would be a big mistake\", but added that going in to take Hamas militants out \"was a necessary requirement\".\n\nReuters contributed to this story."
    },
    {
        "source": "http://www.chinadaily.com.cn",
        "url": "http://www.chinadaily.com.cn/a/202310/16/WS652c9d34a31090682a5e8b90.html",
        "title": "Israel-Palestine conflict and 50 years of failed military policies",
        "published_date": "2023-10-16",
        "content": "Photo taken on Oct 13, 2023 shows buildings destroyed in Israeli strikes in Gaza city. [Photo/Xinhua]\n\nDespite massive aid, US policies have failed to achieve peace in Israel, West Bank and Gaza thus eroding US credibility in the region. Why did US policies fail? Could Chinese policies contribute to peace?\n\nOn Saturday, Palestinian militant groups, led by Hamas, launched a brutal coordinated offensive against nearby Israeli cities, Gaza border crossings, and adjacent military installations. It was a lethal twist after a volatile year as the far-right government's descent toward autocracy has been challenged by mass demonstrations in Israel.\n\nAs Israel declared a state of emergency and war and began to bomb Gaza, China's permanent UN representative Zhan Jun spoke for de-escalation to prevent \"further casualties of civilians.\" Yet, in Beijing, Senate majority leader Chuck Schumer blasted China's cautious stance in Beijing.\n\nExtraordinarily costly in terms of Israeli casualties, wounded and captured, the Hamas offensive is the first direct conflict within Israeli territory since the country's founding. According to Hamas, it is in response to all the atrocities the Palestinians have faced over the decades, and the \"desecration of the Al-Aqsa Mosque\" by the Israeli far-right.\n\nThe status quo has long been untenable. Israel is sitting on a 50-year time bomb.\n\nEconomic dead-end\n\nEven in 1994, amid the peace talks in Oslo, Palestinian per capita income was just 15% relative to the Israeli level. But hopes for peace died with the Jewish far-right assassination of Prime Minister Yitzhak Rabin.\n\nDespite all the hoopla by the Trump and Biden administrations that the Middle East is at the cusp of peace and prosperity, Palestinian per capita income has fallen and is now only 12.9% relative to the Israeli level; lower than decades ago (Figure 1).\n\nFigure 1 Per capita income in Israel and West Bank/Gaza, 1995-2023\n\nGDP Per Capita PPP: Israel Vs West Bank and Gaza (1995-2023). Data from World Bank\n\nSource: Author; data from World Bank\n\nAs bad as these aggregate figures are, they reflect Palestinian averages, not Gaza's hell. Years of isolation and recurrent conflicts have left the local economy far behind the West Bank's, due to the Israeli-imposed blockade, four wars, and domestic divisions. Today, Gazan per capita income is less than a third of that in the West Bank. Almost half of the labor is unemployed, and over half of the population lives below the national poverty line (Figure 2).\n\nFigure 2 Economic Divergence Between the West Bank and Gaza\n\nSource: IMF\n\nPalestine under apartheid\n\nWell before the ruthless Hamas offensive, the Palestinian stagnation reflected economic devastation that exceeded that of apartheid South Africa. During the period of apartheid (1948-94), the blacks' per capita income relative to the whites climbed from 8.6% to 13.5%. In relative terms, the Palestinians' starting point was almost twice as high after the Oslo Accords. But today it's behind that of the blacks at the end of the apartheid. The reversal took place under the watch of the Trump and Biden administrations (Figure 3).\n\nFigure 3 Two kinds of apartheid: From South Africa to Palestine\n\nSource: Author; data from IMF\n\nFarsighted Israeli leaders no longer deny the reality of apartheid. Last year, former attorney general Michael Ben-Yair called Israel \"an apartheid regime.\" Recently, the parliament's former speaker Avraham Burg and renowned historian Benny Morris were among more than 2,000 Israeli and American public figures who signed a public statement that \"Palestinians live under a regime of apartheid.\"\n\nAnd in early September, Tamir Pardo, the former chief of Mossad (2011-16), said to the Associated Press that Israel's mechanisms for controlling the Palestinians matched the old South Africa. \"There is an apartheid state here,\" Tamir warned.\n\nFrom US militarization to Chinese development?\n\nIronically, the erosion of Israeli economy has gone hand in hand with soaring US economic and military aid, which took off after the 1973 War. Until 2002, Israel was the top recipient of US aid, and it has stayed among the top three with Iraq, Afghanistan, and Ukraine. Overall, US has given Israel over $260 billion in military and economic aid, and $10 billion more for missile defense systems (Figure 4).\n\nFigure 4 US aid to Israel since 1950\n\nSource: ForeignAssistance.gov\n\nNonetheless, the Israeli economy is more polarized than ever before. Worse, Netanyahu's government is further undermining Israeli economy. In May, 280 senior economists warned that the government's budget allocations to the ultra-religious Haredi-groups, in exchange for their coalition support, \"will transform Israel in the long run from an advanced and prosperous country to a backward country.\"\n\nYet, the Democratic Biden administration has continued Trump's Middle East policies, which effectively ignore the Palestinian nightmare. Washington's bipartisan consensus is driven by the priorities of the Pentagon and the Big Defense.\n\nStressing the importance of peace and development, China has called for an \"immediate cease-fire\" and repeated its support for a two-state solution with an independent state of Palestine as a way out of the conflict.\n\nBy contrast, President Biden dispatched Blinken to Israel in show of support, while both struggled to portray the United States as the neutral intermediary it has not been for decades in the Middle East. Meanwhile, Republican hawks, such as Lindsey Graham, said they were ready to \"support the bombing of Iran,\" with or without any evidence on the links between Hamas offensive and Iran.\n\nThe war is manna for heaven for Israel's far-right government, as well.\n\nNetanyahu and the rise of Hamas and far-right\n\nAfter the Yom Kippur War, Israel's Labor coalition began to expand security boundaries of Jerusalem eastward. That led a group of Messianic settlers to create a foothold in the West Bank. I had no doubts of their final objectives after a mid-'70s meeting in Jerusalem with Meir Kahane, the US-born rabbi and far-right politician who advocated ethnic cleansing of Palestinians until his violent death.\n\nAfterwards, the Madrid Conference in 1991 and the subsequent Oslo Accords offered a glimpse of a more peaceful two-state future; until Rabin's assassination. In Israel, Kahane's politics gave rise to new far-right movements and assassins, killings of Palestinians and political parties like Itamar Ben-Gvir's \"Jewish Power.\" As Netanyahu's minister of national security, he calls for expulsions of Arab citizens and in part sparked the Hamas offensive by a provocative visit to the Temple Mount.\n\nLaunched in 1988 in Gaza, Hamas refused to accept Israel's existence. But for over a decade before, Israeli authorities tacitly enabled its rise, hoping to exploit it against Arafat's Palestinian Liberation Organization (PLO). While PLO coped with Israeli repression, the Islamists' activities were allowed in Gaza. One of their adherents was the wheelchair-bound Sheik Ahmed Yassin. Just as the US nurtured Islamists like Osama bin Laden prior to 9/11, Israel allowed Yassin's Hamas to expand, according to the Wall Street Journal.\n\nWhen the peace process began, Hamas launched attacks against civilians, which contributed to the rise of Netanyahu and the Israeli far-right in 1996. Yet, as Prime Minister, Netanyahu ordered Yassin to be released from prison, despite a life sentence. Perhaps the idea was that the Islamists would sabotage the Oslo accords. Yassin fought Israel until his killing. And in 2007, after an election victory that rankled both the West and Fatah, Hamas took over Gaza.\n\nToday, Netanyahu government's strategic solution seems to be sheer destruction. Hence, the Dahiya Doctrine, tested in the 2006 Lebanon and 2008-09 Gaza wars. It is premised on the demolition of the civilian infrastructure and the deployment of \"disproportionate power,\" which critics call \"state terrorism.\"\n\nGive peace and development a chance\n\nUnlike Washington, Beijing is seen in the Middle East as a more neutral intermediary whose primary focus is on economic development rather than multi-billion-dollar weapons sales. In March, China brokered discussions between Saudi Arabia and Iran, enabling a diplomatic rapprochement. In June, China outlined its vision for brokering peace between Israel and the Palestinians.\n\nHistorically, China has had close diplomatic ties with Palestinian leaders. This year the president of the Palestinian Authority, Mahmoud Abbas, made his fifth official visit to China. But Beijing has also deepened relations with Israel, investing in infrastructure and the country's vibrant technology sector. China is seen largely as a positive force by most Israelis.\n\nIn the past half a century, no US-brokered initiative has achieved enduring peace in the Middle East. Washington has a geopolitical interest in the region as an energy reserve and US defense contractors' lucrative client. By contrast, China's approach is paced by stability and cooperation necessary for economic development.\n\nBoth the US and China have a role in the Middle East. But it is time to give peace and development a chance.\n\nDr. Dan Steinbock is the founder of Difference Group and has served at the India, China and America Institute (US), Shanghai Institute for International Studies (China) and the EU Center (Singapore). The original version was published by China-US Focus on October 13. The views don't necessarily reflect those of China Daily.\n\nIf you have a specific expertise, or would like to share your thought about our stories, then send us your writings at opinion@chinadaily.com.cn, and comment@chinadaily.com.cn."
    },
    {
        "source": "http://www.chinadaily.com.cn",
        "url": "http://www.chinadaily.com.cn/a/202310/12/WS65279968a31090682a5e82b4.html",
        "title": "EU can play a vital role in easing China-US tensions",
        "published_date": "2023-10-12",
        "content": "[Photo/IC]\n\nEuropean Union foreign affairs chief Josep Borrell's visit to China this week for the China-EU High-level Strategic Dialogue is a good opportunity to stabilize the relations between the two sides which has deteriorated in recent years largely due to the growing geopolitical tensions between Beijing and Washington.\n\nThe Russia-Ukraine conflict, which has no end in sight, and the Israeli-Palestinian conflict, which erupted again on Saturday and has resulted in huge civilian casualties, are tragic reminders of the importance of peace. This is especially true for the EU given Europe's geographical proximity to both Ukraine and Israel.\n\nThe escalating migration crisis in the EU, which has contributed to rising popularism in some of the bloc's member states, can be partly attributed to the United States' and NATO's wars and military interventions in Afghanistan, Iraq, Libya and Syria over the past more than two decades.\n\nTo end two ongoing conflicts, China has called for immediate cease-fire, and urged the disputing parties to resolve their differences through dialogue and diplomacy. The EU can play a positive role in this by working with China, as their interests are best served by restoring peace and maintaining stability in the regions.\n\nThere is widespread concern that the EU might get directly involved in the US-China disputes. But in helping defuse the tensions between Beijing and Washington, the EU needs to exercise strategic autonomy and be an honest broker between China and the US. And its aim should be to prevent the world from sliding into a new Cold War or, God forbid, a hot war.\n\nAs for Borrell, he should recall the horrible human suffering of Europeans during the Cold War, and sincerely work to prevent history from repeating.\n\nIf the EU plays such a role well, it will not only contribute to global peace, but also help establish itself as a pillar holding up a multipolar world, one in which developing countries of the Global South will have an equal say.\n\nThat, however, is no easy task. The EU's strategic autonomy has been under threat because of its excessive dependence on the US in matters of defense and the overwhelming influence of the US across Europe. The EU has often been coerced or cajoled by Washington when it comes to adopting a strategic policy toward China. Brussels' rhetoric on China has often mimicked those of the White House.\n\nBorrell should also remember that China and the EU, including his home country, Spain, were far more different in the 1970s and 1980s when they established diplomatic ties with China than they are today. So exaggerating the differences like some EU politicians have been doing today is not conducive to improving China-EU relations.\n\nAfter all, China and the EU have gained a lot from trade and investment, and collaboration in education and science and technology sectors, and fighting climate change together in the past decades despite the sharp differences in their political systems. Engagement and cooperation have always helped narrow and effectively manage the differences.\n\nEU officials like to complain about trade and investment barriers \"erected\" by China, but the China-EU Comprehensive Agreement on Investment, if implemented, could address some of the grievances of both sides and thus should be ratified by the EU as soon as possible. Not ratifying it could create a lose-lose situation. China, on the other hand, also has serious concerns about the growing protectionism in the EU.\n\nAlso, the EU should stop projecting its \"Global Gateway\" initiative as a counter to the China-proposed Belt and Road Initiative, which is improving infrastructure connectivity. Instead, it should join hands to share their practices, and help synergize the two initiatives to benefit the developing world.\n\nThe world is facing many unprecedented challenges. Close cooperation between China and the EU will help ensure a better future for our generation, as well as the future generations.\n\nThe author is chief of China Daily EU Bureau based in Brussels.\n\nchenweihua@chinadaily.com.cn"
    }
]